using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Graphics;
using OpenLaMulana.Entities;
using OpenLaMulana.Graphics;
using OpenLaMulana.System;
using System;
using static OpenLaMulana.Global;

namespace OpenLaMulana.Audio
{
    public class Jukebox
    {
        string[] composerArrangerStringJP = { "作・編曲：ならむら", "作・編曲：サミエル", "作曲：ならむら　編曲：サミエル", "編曲：ならむら", "編曲：サミエル" };
        string[] composerArrangerStringEN = { "Composition and Arrangement: Naramura", "Composition and Arrangement: Samieru", "Composition: Naramura　Arrangement: Samieru", "Arrangement: Naramura", "Arrangement: Samieru" };
        string[] trackNamesJP, trackNamesEN, naramuraComments, samieruComments, naramuraCommentsEN, samieruCommentsEN;

        int[] composerArranger = { 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 2, 0, 1, 0, 0, 0, 3, 4, 3, 0, 0, 0, 4, 3, 4, 3, 3, 3, 3, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 3, 4 };
        private int[] JukeboxSongOrder = { 18, 17, 0, 33, 32, 39, 1, 20, 23, 22, 2, 34, 8, 24, 3, 36, 5, 26, 4, 35, 6, 25, 7, 38, 9, 11, 12, 29, 14, 15, 27, 13, 37, 16, 28, 21, 30, 10, 31, 40, 41, 42, 19, 43, 44, 45, 46, 47, 48, 49, 56, 50, 51, 52, 53, 54, 57, 55, 74, 75, 60, 61, 62, 63, 64, 58, 59, 65, 66, 67, 68, 69, 70, 71, 72, 73 };

        private int selectedSong = 2;
        private int totalSongs = 75;
        private int _actualGameBGM = -1;
        private bool _isPlaying = false;
        private int _mutingChannelPosition = 1;
        private Sprite _menuCursor = null;

        public Jukebox()
        {
            Texture2D _tex = Global.TextureManager.GetTexture(Global.Textures.ITEM);
            _menuCursor = Global.TextureManager.Get8x8Tile(_tex, 0, 1, Vector2.Zero);

            InitializeComments();
        }

        public int DrawOrder { get; set; } = 0;

        public void Update(GameTime gameTime)
        {
            if (_actualGameBGM < 0 && !_isPlaying)
            {
                _actualGameBGM = Global.AudioManager.IsPlaying();
                Global.AudioManager.StopMusic();
            }
            var selectionMoveX = InputManager.DirPressedX;
            var selectionMoveY = InputManager.DirPressedY;
            var keyCancelPressed = InputManager.PressedKeys[(int)ControllerKeys.MENU_CANCEL];
            var keyConfirmPressed = InputManager.PressedKeys[(int)ControllerKeys.MENU_CONFIRM];
            var keyMainWeaponPressed = InputManager.PressedKeys[(int)ControllerKeys.MAIN_WEAPON];

            selectedSong += -selectionMoveY;
            if (selectedSong < 0)
                selectedSong = totalSongs;
            if (selectedSong > totalSongs)
                selectedSong = 0;

            _mutingChannelPosition += selectionMoveX;
            if (_mutingChannelPosition < 1)
                _mutingChannelPosition = 16;
            if (_mutingChannelPosition > 16)
                _mutingChannelPosition = 1;

            if (selectionMoveY != 0)
                Global.AudioManager.PlaySFX(SFX.MSX_NAVIGATE);

            if (keyMainWeaponPressed)
            {
                Global.AudioManager.ToggleMIDIChannel(_mutingChannelPosition);
            }

            if (keyConfirmPressed)
            {
                Global.AudioManager.ChangeSongs(JukeboxSongOrder[selectedSong], true);
                _isPlaying = true;
            }

            if (keyCancelPressed)
            {
                Global.AudioManager.StopMusic();
                _isPlaying = false;
            }




            //Globals.TextManager.DrawText(0, 0, Globals.TextManager.GetText(textIndex, Languages.English));
            int songID = GetCurrentSongID();

            string str = String.Empty;
            /*
            if (songID < 10)
                str += "0";

            str += songID.ToString();*/

            string versionString = String.Empty;
            switch (Global.MobileSuperX.GetEmulatorState())
            {
                case MobileSuperX.EmulatorStates.JKB_1:
                    versionString = "0.0 ALPHA";
                    break;
                case MobileSuperX.EmulatorStates.JKB_2:
                    versionString = "0.5 BETA";
                    break;
                case MobileSuperX.EmulatorStates.JKB_3:
                    versionString = "1.0";
                    break;
            }
            string headerString = String.Format("La-Mulana Jukebox v" + versionString + "\\10\\10Left/Right - cycle tracks\\10Confirm/Cancel - Stop/Play\\10Muting Channel: {0}", _mutingChannelPosition);
            if (_isPlaying)
                headerString += "\\10[Playing]";
            else
                headerString += "\\10[Stopped]";
            Global.TextManager.QueueTexT(3 * 8, 8 * 18, String.Format("{0}:{1} {2}", selectedSong, GetSongName(), str), 26);
            Global.TextManager.QueueTexT(3 * 8, 3 * 8, headerString);

            UInt32 enabledChannels = Global.AudioManager.GetEnabledChannels();
            for (int i = 0; i < 16; i++)
            {
                int channelVolume = (int)Math.Clamp(Math.Round(Global.AudioManager.GetChannelVolume(i + 1) * 255), 0, 255);
                Color color = Color.White;
                if (((enabledChannels >> i) & 1U) == 0)
                    color = new Color(255, 51, 51, 255);

                var xOff = (i % 8) * 8 * 3;
                var yOff = (i / 8) * 16;

                if (i == _mutingChannelPosition - 1)
                    Global.TextManager.QueueTexT(6 * 8 + xOff, 11 * 8 + yOff, "\\255", 1, Color.White);//_menuCursor.Draw(spriteBatch, new Vector2(4 * 8 + xOff, 12 * 8 + yOff));

                string outStr = String.Empty;
                if (channelVolume < 0x10)
                {
                    outStr += "0";
                }
                outStr += Convert.ToString(channelVolume, 16).ToUpper();

                Global.TextManager.QueueTexT(5 * 8 + xOff, 12 * 8 + yOff, outStr, 32, color);
            }
        }

        public void ResetJukeBox()
        {
            if (_actualGameBGM >= 0)
                Global.AudioManager.ChangeSongs(_actualGameBGM, false);
            selectedSong = 0;
            _actualGameBGM = -1;
            _isPlaying = false;
            Global.AudioManager.SetEnabledChannels(0xFFFF);
        }

        public void Draw(SpriteBatch spriteBatch, GameTime gameTime)
        {

        }

        internal int GetCurrentSongID()
        {
            return JukeboxSongOrder[selectedSong];
        }

        internal int IsPlaying()
        {
            return Global.AudioManager.IsPlaying();
        }

        internal string GetSongName()
        {
            switch (Global.CurrLang)
            {
                default:
                case Global.Languages.English:
                    return trackNamesEN[selectedSong];
                case Global.Languages.Japanese:
                    return trackNamesJP[selectedSong];
            }
        }

        private void InitializeComments()
        {
            trackNamesJP = new string[] {
                "Earth Wind",
"LA-MULANA",
"Mr.Explorer",
"Xelpud",
"BONGA WANGA",
"Fearless challenger -long version-",
"Fearless challenger",
"Requiem",
"King Konda",
"Fanfale",
"Grand History",
"G•I•L•D",
"Primitive Dance",
"Giant's Rage",
"Curse of IRON PIPE",
"Dodge",
"Inferno",
"Dangerous Raid",
"Sacred Tomb",
"Wise Men",
"M.U.",
"High-Speed Beast",
"Grand Ritual",
"Legendary Small Beauty",
"Mother will be awakened",
"Wonder of the Wonder",
"Giant's Cry",
"Sabbat",
"Moon Light Dance",
"GIGA-MAGMA",
"In the bottom",
"Sky Tower",
"Fairy",
"Song of Curry",
"Ancient Machine",
"Death Game",
"Interstice of the Dimension",
"Awakening",
"Last Battle?",
"Good Night Mom",
"Escape!!!",
"Run toward the sun",
"GAME OVER",
"行進曲「威風堂々」 -空中戦のテーマ-",
"アイネ・クライネ・ナハトムジーク -573星のテーマ-",
"舞踏組曲「ガイーヌ」より「剣の舞」 -瞑想のパオラ-",
"この胸のむきむき",
"歯が痛い告白",
"伝説の樹の下でタイマン",
"ガリウスの迷宮 -CASTLE-",
"ガリウスの迷宮 -ワールドスタート-",
"ガリウスの迷宮 -WORLD-",
"ガリウスの迷宮 -神様-",
"ガリウスの迷宮 -大悪魔の部屋-",
"ガリウスの迷宮 -大悪魔音頭-",
"ガリウスの迷宮 -ワールドクリア-",
"真夜中のジャングル",
"Treasure sealed off",
"[没] Curse of Iron Pipe (Ver. A)",
"[没] Aqua Wish",
"[没] Wonder of the Wonder -Prot Type-",
"[没] Spirit of Giants",
"[没] Crazy Moon",
"[没] Road of Destiny",
"[没] ELECTRIC PROPHET",
"[没] Mother",
"[没] Easter",
"[没] Sabbat -Prot Type-",
"[没] Take me to the sky,my children",
"[没] Good Morning Mom",
"[没] Blood And Beast",
"[没] Ancient Voice",
"[没] カレーには月桂樹の葉を入れて煮込め",
"[没] Fearless challenger 体験版",
"[没] 行進曲「威風堂々」-空中戦のテーマ-",
"[没] 交響曲「新世界」-５７３星のテーマ-"
            };

            trackNamesEN = new string[] {
                "Earth Wind",
"LA-MULANA",
"Mr.Explorer",
"Xelpud",
"BONGA WANGA",
"Fearless challenger -long version-",
"Fearless challenger",
"Requiem",
"King Konda",
"Fanfare",
"Grand History",
"G-U-I-L-D",
"Primitive Dance",
"Giant's Rage",
"Curse of IRON PIPE",
"Dodge",
"Inferno",
"Dangerous Raid",
"Sacred Tomb",
"Wise Men",
"M.U.",
"High-Speed Beast",
"Grand Ritual",
"Legendary Small Beauty",
"Mother will be awakened",
"Wonder of the Wonder",
"Giant's Cry",
"Sabbat",
"Moon Light Dance",
"GIGA-MAGMA",
"In the bottom",
"Sky Tower",
"Fairy",
"Song of Curry",
"Ancient Machine",
"Death Game",
"Interstice of the Dimension",
"Awakening",
"Last Battle?",
"Good Night Mom",
"Escape!!!",
"Run toward the sun",
"GAME OVER",
"March \"Pomp and Circumstance\" -Aerial Battle Theme-",
"Eine Kleine Nachtmusik -Theme of Star 573-",
"\"Sabre Dance\" from the Ballet \"Gayane\" -Meditating Paola-",
"The Suitability of This Heart",
"Confession of a Hurting Tooth",
"One-on-one Battle Beneath the Legendary Tree",
"Maze of Galious -CASTLE-",
"Maze of Galious -World Start-",
"Maze of Galious -WORLD-",
"Maze of Galious -God-",
"Maze of Galious -Great Demon's Chamber-",
"Maze of Galious -Great Demon Ondo-",
"Maze of Galious -World Clear-",
"Midnight Jungle",
"Treasure sealed off",
"[Ver. A] Curse of Iron Pipe",
"[Beta] Aqua Wish",
"[Beta] Wonder of the Wonder -Prot Type-",
"[Beta] Spirits of Giants",
"[Beta] Crazy Moon",
"[Beta] Road of Destiny",
"[Beta] ELECTRIC PROPHET",
"[Beta] Mother",
"[Beta] Easter",
"[Beta] Sabbat -Prot Type-",
"[Beta] Take me to the sky, my children",
"[Beta] Good Morning Mom",
"[Beta] Blood And Beast",
"[Beta] Ancient Voice",
"[Beta] Put and Mix Bay Laurel Leaves in Curry",
"[Demo] Fearless challenger",
"[Beta] March \"\"Pomp and Circumstance\"\" -Aerial Battle Theme-",
"[Beta] Symphony \"New World\" -Theme of Star 573-"
            };


            naramuraComments = new string[] {
"地味ながら気に入っている曲。先行公開版からデータ自体は存在していてしっかりとフォルダの中に入っていたのにデモが間に合わず完成版まで流れる事のなかった曲。最後にキメのフレーズを作っちゃえと思い、エルギーザの封印のステージクリア曲をモチーフにしたんですが、なんというかまぁ、そのまんまじゃないですか。結構変えたつもりなんですがね。ははは、偶然偶然。",
"体験版のときから出来ていた曲ですが、特徴もない上に流れる所も限定されているし、ほっておいてもデモが始まるわけでもなかったので、何の話題もないまま埋もれている曲です。最初はこの倍の長さがあったんですが、完成版でデモが流れるとするとこんな長さ待たんとあかんのかい！ってことで短くしたんです。何も考えていない証拠ですね。出だしのでーん、でーん、でぇ～～～んの部分。これはタイトル表示時にスペランカーのタイトルみたいにしたくて作りましたが。",
"ボクの知らないうちに出来上がっていた曲ですな。なんらかのスタートデモの必要があったんですが、うまい具合に長めのイントロがあって助かりましたね。でも実際に作ってみると地図上を歩くには少し短かった気もして調整が難しかったような。ただ単に独立した地上用の曲でしたが、最後の方に結局アレンジされる事になりましたなー。",
"この曲も無限回廊と同じく、８年ぐらい前に作った曲のフレーズを使いました。音量が揺れるギターの音はうまくいきました。",
"「BONGA」は現地の言葉で「ねじる」、「WANGA」は「ねぶる」です。今考えました。",
"遺跡初侵入時に流れるバージョンですね。まったくノータッチ。といいつつこの追加イントロ部分はラスボスのイントロにアレンジされてます。",
"俺の口からこの曲を冷静に語る事は出来ないぜ。なんせ俺の没１号の引導を渡してくれた曲だからね！体験版で仕上がっていた曲だったので、ゲームが出来上がるにつれ他の曲とのバランスが取れなくなってきて、俺が何パートか音を足したような記憶がありますよ。",
"この曲はー。THE ALFEEの「星空のディスタンス」のイントロのバッキングのシンセサイザーフレーズそのまんまです。もちろんコードは別のものになっているので曲そのまんまってわけじゃないですが。ガリウスを知っている人ならわかると思いますが、あの大悪魔を呼び出す前の何とも言えない厳粛な雰囲気を出したかったのです。",
"全てのボス曲のベースになる曲ですね。なんか知らん間に作られてましたけど。これがボス曲のテーマになる予定でしたが、ボスごとに曲を変えようという話がサミエルさんから出たんです（出なくても俺が提案したと思う）。ちぐはぐになってもアレなので、イントロだけは同じにしようと提案しました。ところがまーこのイントロが半音使ったりでアレンジするのが難しかったなー。",
"すらーっとシンプルに終わればいいのに最後に「んばんばんばばん！」とかベースフレーズを入れてしまう辺りがとっても俺らしいともいます。",
"バリで買ったガムラン風テクノを参考にして作りました。SCC風の曲調を心がけつつも、ゲームの内容から遺跡っぽいというか、民族音楽調のゲーム音楽って作れないかなと言う事で挑戦してみましたがいかがでございましょう。この曲のSCCバージョンにはとんでもないミスがあります。この曲は３連符で跳ねるようなリズムのシャッフルと言うビートですが、作り始めたときはノーマルビートで作ってました。そんで後半を作っている時に、「この曲、もしかしてシャッフルですか？」と気づきまして。しかしこのSCC曲データ、作り直すには仮のMIDIデータから作り直さなければならないわけで、……めんどくさ。ということでそのままになってます。MIDIデータはちゃんとシャッフルになってますよ。",
"昔ながらのゲームらしい、店の曲をイメージしました。しかしまぁ後半のフレーズの適当な事。",
"ネタがつきかけていた頃に作った曲。うそ、作ってない。ネタに苦しんで、大昔に作った曲で再利用出来るものはないかなーってことで８年前ぐらいに作った演劇用のダンス曲をそのまま使いました。３分もあるんでやんの。全然ゲーム向きじゃないでしょうに。ドラムとベースだけになる所とかもう、２音色だけでこの音色で持つかっちゅーねん。ゲームっぽくないとか微妙な感想が来たらすぐさま別の曲にしてやろうかと思ってたんですが、幸運にも「後半がかっこいい」というやや微妙ながらも褒め言葉を頂いたんでそのままに。",
"サキトのスローなどっしんどっしんな攻撃にマッチしたテンポの曲です。アレンジ担当しましたが、元が結構好きな曲調だったので、いらんことせずに曲そのままの形でアレンジしました。",
"自分の担当だった空の水源曲を封印してサミエルさんに依頼したものですね。自分の作ったものと結構ノリがちがうので流れた当初は慣れるのに時間かかりましたわ。その分、好き勝手に裏アレンジ出来ましたけども。俺も元ネタは知らずに実はアシュギーネのテーマが入ってたんですけども、あやうくこの部分までアレンジしてしまう所でしたよ。なんかMIDI版で長くなってるしよ。",
"イントロの、「ひょっ、ひょっ、ひょっ」ってのがやりたかっただけです。そんだけ！きゃはー！",
"「死ね」という声が聞こえてきそうな、見事なアクションゲーム曲でございます。MIDIのアレンジを担当する事になったんですが、前々から自分がアレンジしたら重厚なブラスアレンジが似合うだろうなーと思ってました。その考えに従いブラスアレンジしたんですが、ぜーんぜんイメージしたものに仕上がらなかったのが心残り。",
"いいなーこの曲。というかアレンジ。ドラムどっどこどっどこ。アレンジを担当しまして、ドラムやメロディーを左右にばんばか振らせていただきました。もともとがこれとエルマックで、どっちもスピード感だねぇと話していて、二人ともF1スピリットなイメージを持っていたので二人で担当分けたんですが、面白いぐらいに違う曲調になりましたね。",
"かなり初期から、特にピラミッドという意識もなく作った、特徴のなーい曲でございます。いやいやほんとに。元はもう少し短い曲でした。後半の曲調が変わる部分がまるまるなかったんです。サミエルさんに短いとか、物足りないとか言われたんだっけな？この頃に作った曲は自分にしては素直にゲーム音楽してますね。GR3で苦労して身につけたレトロゲーム曲っぽさがまだ残っていたあの頃。今？もうない。",
"８bitでメモリがないよ、こんな所の曲に容量さけないよって言う感じのシンプル曲。３０分もかからずに出来たんじゃないかな。どーも俺はこういうスタンスで作った方がゲームらしい曲が作れるみたいです。",
"なんだか、SSCCの使い方を「掴んだ」曲でした。具体的に言うと、それまでに作った曲でこの曲程テンポの遅い曲ってのがなかったわけです。テンポが速いと音の洪水でいろいろごまかせるんですが、遅いとフレーズの善し悪しとかも目立ちますし、音色のしょぼさも目立つわけです。そこで長い音には必ず音量増減やゆらしをいれて、長い音ばかりなのでバックで小刻みなフレーズを入れて、波形的に似た音を選ばないようにしたり。結構まじめに考えて作曲しました。これで褒められたもんだからしばらく調子に乗って没いっぱいくらうんですけども。",
"トロッコということで、T-SQUAREばりのフュージョンを！ロマサガ３の魔戦車ばりのスピード感を！で作ったらこうなりました。メロディラインがとってもフュージョン風です。後はもう、ベースやドラムが細かく刻んでればスピード感出るじゃねーの？という安直な考えで作りました。",
"早いうちから出来上がっていたのに定着する場所が決まらずさまよい続けた曲。元々は導きの門だったのに。無限回廊にいったりして双連迷宮に落ち着いたわけです。各曲で曲調がかぶらないように、コナミらしさを損なわないように歴代のMSXコナミゲームミュージックから、これを参考にしようって決めてから作ってたんですが、これはドラキュラのステージ１を参考にしてます。出だしの「テテッテッテー」て部分とバッキングのピアノのフレーズ。ふふん、これだけ限定していればパクリなんて思われないのさ。むんふー。",
"なにかと複雑な曲を作りがちの自分に反省している時に作ったもの。モロにシャロムの「グリーグ城」と「海」の曲ですね。揺れるようにのびる音が気持ちいい曲にしたくて。いつもどっどこどっどこぐちゃぐちゃした曲を作っているわたくし、意外にもこういう曲も好きだったりします。好きなもんだから無駄に長くなってるし。４賢者がかわいそうです。下っ端やぞ、こいつら。",
"これも紆余曲折ある曲ですね。元々はNHKシルクロード特集かなんかで流れていた曲がいいなぁーと思って雰囲気まねした曲で。それでも後半のメロディーの微妙さ加減とか、あまり気に入ってなかったんで、開発初期に出来てはいたけども早いうちから自分で「仮の曲でした」と引っ込めてしまいました。聖母の祠はこの後４回ぐらい細かく曲が変わってるんですが結局どれもしっくりこず、duplexさんが「あの曲好きで迷いの門作る時にあの曲をイメージしたんですけど」と言われ、「そう？（微笑」ってことでこの曲に戻しましたとさ。もちろん、後半の微妙だった所は直しましたよ。",
"この曲もこの形になるまで随分手間がかかりました。迷いってことで、やたらと不思議感を出すってことと、それでもあの勇敢な導きの曲のアレンジなければならないと。モチーフはグラ２神殿ステージなんですが、アレンジ作業第１弾で作りました。最初は導きのメロディーそのままでキモくなっただけ。あまりにも稚拙なのでもっと神殿ステージ曲に近づけて、それも変に短かったのでこの形になりました。気がつけば３／４拍子になって原曲のフレーズは残してあるつもりだけど客観的に聴いてみるとちっとも原曲がわからなくなりました。残ってるのは盛り上がった後の繰り返しパターンの部分だけなんですが、わかりますかね？",
"MIDIアレンジを担当しました。SCC版を作る為の仮MIDIを渡されて、そのデータがすでにバッキングにギターを使ってロックな曲になってました。何も考えずにMIDI用にロックとして淡々とアレンジしてたんですが、よく考えたら氷のステージな訳で。安直ではありますがキラキラ音色を増やして力技で氷っぽく。それだけでは飽き足らず、巨人ステージな訳で巨人に殴られてしまえという思いを込めて「パンチ」って音色も使いました。",
"これもモチーフは女神の塔と同じ。チェンバロが効いたゴシック音楽を目指しました。もーちっともゲーム音楽を作ろうって言う気が感じられませんな。SCC版では音色の問題からか、はたまた音色に合わせた曲作りが出来ていないからか、ちっとも理想の音に鳴りませんで、「静かな曲なんで演出で派手にせぇって言われてると思いましたよー！」とか言われる始末。出来なかっただけです。MIDI版で雪辱を晴らしています。",
"MIDIアレンジ担当でございます。開発後期でサミエルさんが「この曲、実はマイケルジャクソンのスリラーなんすよ」と彼は言ったね！アレンジまかされている間、サミエルさんは海外に行ってましたので確認を取ろうにも取れないわけです。しかたないので、本人の望む形かどうかは知りませんが、ドアの閉まる音とか、犬の遠吠えとか、スリラーを連想するものを盛り込ませてよりスリラー感をアップしておきました。仕方ないよね、連絡取れなかったんだから。",
"これも気に入ってます。グラフィックは変わっちゃってますけど、もともとは機械的な雰囲気のフィールドだったんでテクノ系のフレーズで作っちゃってます。MIDI版ではベースラインを変更してハードディストーションギターをシンプルに鳴らす。うーん、好き。自分の大好きなSOFT BALLET風なアレンジでございます。リズムも拍も原曲とは変わってますがうまい事もとがわかる程度にアレンジ出来たと思います。これを作っている頃、どーしてもメロディラインをぐちゃぐちゃといじってしまう自分を抑えてシンプルなメロディーという目標でやってます。前半部分はとってもシンプルでございますね。",
"エルマックで「なんか無駄にメロディー複雑にしちゃって、ゲーム音楽ってこういうのじゃないよなぁ」という反省の元に作ったシンプルなフレーズの集合体。でも我慢しきれずにドラムはどっどこどっどこ鳴りまくってますけどね。何か仕込まないと気がすまんのですよ。病気ですわ、病気。",
"自分の中では今回音楽的にもゲーム曲としてもバランスの取れた自信作です。モチーフは、もはやゲーム全然関係ないですが、MALICE MIZER（Gackt抜けた後）のハードロックにチェンバロがチキチキ鳴ってる曲。こういう、音色的に凝った音楽が好きなのです。この曲でずーっとバックで鳴り続けてるテロレロテロレロって音です。メロディーもそのまま残しつつも無理矢理コード変えて。うふふふ、楽しいね。こんな事を考えつつもちゃんとゲーム曲になっているのは、MANA様がゲームマニアだからに違いない。なんというかこう、作ってて盛り上がって来ると頭を使わずともばんばんノリで曲が出来てしまうもんなんです。",
"これもゲームならではの曲ですわね。意外とこういうの作るの苦にならなかったりしますね。なんなんでしょ。向いているのかいないのか。",
"カレー。下手するとコミカルゲームのBGMなんて言われていますが、ゴーサインを出したのは俺ですから。根拠はないんですがね、なんか産声フィールドに合うしゲーム内でも面白いポジションになるんじゃないかと、聴いた時に思ったんです。MIDIアレンジさせてもらいましたが、うまい具合に民族打楽器使ってカレー風味を増せましたね。ち、ターバンまいた敵キャラぐらい作っておくべきだったな。",
"アレンジしましたー。MIDI版聴いてもらえればわかると思いますけども、こーんな面白いモチーフ、ごちゃごちゃアイディアがあふれて仕方ないんです。キモい音いっぱい重ねさせて頂きました。極めつけは、古代の宇宙船だからといって「スペースシップ」なんていう、普通じゃ絶対使われないような音色を入れてます。奥の方で「うーーーーんぴしゅぅううううん」っていってる音。我ながら安直ですわな。",
"「古代日本」でオファーしたはず。さらに、中ボス連戦をあおる曲と言うオファーもした。むーん、ジャパンどこに行ってしもうたん？しかしこんな後半ステージで三味線がちゃんちきちゃんちき鳴ってもずっこけるので、良き判断だと思います。実際中ボスどもの恐怖をあおるのは成功してると思います。SCC版を聴いて、何をイメージしてるんだろうと疑問に思ってたんですが、MIDI版を聴くとその辺がよくわかりますな。",
"シンセサイザーのフレーズが「ぱっ、ぱっ、ぱっ」っと小刻みに鳴る。通勤中に街角テレビから流れてきたボーリング場のコマーシャルの曲が耳に入り、ティアマト思いつかんなぁ、でも時間ないなぁと思ってる頃だったのでフレーズを頂きました。一度聴いただけなので、真似たとしても同じにはなるまい！と思って。これもバフォメットと同じく、SCCではちっとも理想の音になってくれませんでした。ゲームっぽい曲をと考えて作っていたはずなのに、３分近くなると後半にギターソロが入っていたりとか、まったくもってゲーム音楽を作るのに向いてないと思います、私。MIDI版は雪辱としてTHE ALFEEのARCADIAという、ハードロックに民族楽器を混ぜたエスニックハードアレンジを目指して作りました。なんやねん、自分の趣味突っ走ってるだけやん。",
"地上の曲とか、タイトル曲とか、裏表なしで単体として作っていたはずの曲なのに、いつのまにかアレンジのネタとして使われてしまっているという。ということで、あの適当に作ったタイトル曲がロックになって帰って来るとはね！確か、「魔城伝説３シャロムで最終決戦で魔城伝説の曲が流れるような高揚感を誘う曲！」っていうオファーを出したっけ。",
"これまた力の入ってない曲ですね。すぐ出来ましたよ。何も考えないと早いんです。余計な事するから時間かかるし没くらうんですよ。",
"この曲は、ちょっとご機嫌伺いに上京してサミエルさんの家に行った時に調整前を聴かされていました。しかしこのときはもう、ラスボス曲２曲連続ボツをくらってましたから、「もー、なんでもええやん。」という気分でいっぱいでしたとさ。アレンジを担当したんですけど、なっがーい曲なんで変なアレンジすると自分が苦労するだけなのでストレートにアレンジしました。それでもラスボスダブルボツの無念が消えきれず、ラスボス没１曲目でやる予定だったスパニッシュアレンジ。少しでもその匂いを残してやれ！ということで無駄に苦労しましたけどアコースティックギターを追加しました。ははは、アルフィー編成じゃん。やったね。",
"なんの苦労もしませんね、こんなもん。実際のゲーム音楽作曲者もこんな即席制作でゴーサインもらったりする事があるんだろうか？もっとも、こんな終盤の曲は、みんな追い込み時期なのでたいしてチェックも受ける事なく素通りでいってしまうもんなんですがね。",
"これは作曲ソフトを前に作り出しては消して、音ならしては中断しての繰り返し。なかなかどういう曲にするか決まりませんでした。最初はスナッチャーのエンディングのようにサックスがせつない曲にしようかとして、ちっともゲームっぽくならなくて断念。次はインディージョンズのエンディングみたいにしてやろうかと思ったら、何をどうやってもハイドライド２になるので断念。んー、ここでゲーム音楽を作っているんだという初心に戻ってLA-MULANA作曲作業を締めようと、グラ２のエンディングをイメージして作り始めたらハイドライド３のエンディングになってしまったという。MSXサイトで、ハイドライド３なんかのMIDI作ったりしてるんで、MIDIを作るとどーしてもそっちよりになってしまうのです。コナミってなんですか？",
"何も考えずにさらーっと出来ました。こだわりがないとものすごいスピードで作れるわけです。博士はダンディっていう設定だけは早くからあったのでサックスが基本の哀愁あるゲームオーバーです。",
"あれれ、ステージ内の曲で作ったはずなのに。知らない間に空中戦の曲にされてしまいました。今だから言いますけどねぇ。もー完成版公開直前にもなると俺の影響力なんてもう、ミジンコ並みでしたわ。ボクは何も悪くないのに知らない間に「あれれー、ボクの作った空中戦は？」になってしまっていたのです。もー飾りのリーダーですわ。王じゃないです、象徴ですわ。GHQの陰謀ですわ。",
"うんうん、パロディウスのアレンジってこうあるべきよね。有名なフレーズを使い、シューティングに合うように新しいフレーズを混ぜる。俺が作ったの全部そのまんまだもんなぁ。まぁいいです、ミジンコですから。",
"後から知ったんですが、本家パロディウスでこの「剣の舞」は使用済みでしたね。でもあっちはゴエモン和風アレンジだったし。後半のフレーズはとってもパロディウスっぽく、コナミっぽくて結構気に入ってます。つか、この瞑想のパオラ。どれだけの人が元ネタを知ってるのかどうか。",
"SFC版のときめきメモリアルを開発終了間際にも関わらず最初からプレイし（なぜ持っているかは聞かないようにね）、使えそうな曲をピックアップ……するんですけども録音しているわけでもなく、MIDI作る時には聞いた曲は忘れてしまっているので、一番最初に流れる、つまり一番手っ取り早く確認出来る曲をチョイスしただけです。なんかもー、まんまですけどね。フレーズが違うから別の曲ですよ。何言ってるんですか。",
"これはときメモの告白の曲です。もっちろんフレーズは違うものになってます。そこでまた何を考えたか、「ここで一発泣かせるような名曲を作ってやる！」と意気込んで無駄に長い曲になっています。なんでこう、無駄な努力をするんですかね？",
"これはduplexさんからのオファー。SDスナッチャーの戦闘曲とときメモの歌をミックスしてくださいと。す・き・と・か、きらいとーか～ってやつです。まず聞いた事のないこの曲を探すのが手間でした。聞いてしまったら後は早い。こういうネタ的なものは特に。ところでこの曲には歌詞がありまして、余裕があれば戦闘中に表示したかったんです。せっかくなのでここで公開。（イントロ）はいっ！　す　き　と　か　きらいとかぁ～はじめに～いいだしたヤツは～　ん～んんん～いっぽまえにでろや～　むきむき　めもりあぁあぁあ～る",
"な！なんで魔城伝説のイントロからやねん！",
"耳コピが出来ずにネットでガリウスのMIDIをさがしまわりましたが、昔自分で作ってましたとさ。",
"こりゃ難しかったみたいですね。SCCだと原曲のイメージがなかなか出なくて。",
"PSGのあの音をSCCで！MSXユーザーの夢ですやね。無駄にアレンジせず原曲に厚みを増すって言う方向で攻めました。攻めましたよ！",
"こちらも原曲を分厚く。んー、それ以外に手を加えてはいけない曲ですよ、これは。",
"もうその場の勢いで、MIDIも作らずにデータ直接いじって作りました。肉襦袢ボニードラゴンからしてその場の勢いで作ったものですし。",
"なんのコメントもしようがないわ！",
"SCCの音色で作れそうな夜の音を考えて作りました。直前に月光聖殿MIDIアレンジで「ワオーン」を作っていたのも役立ちました。冷静に考えて、夜のジャングルで鈴虫て！",
"この曲の目標は、地獄をプレイしていると曲がせかすような、イライラするような曲を目指して作りました。これの前に完全に調整し終わった曲が１つあるんですが、そっちはもう、イライラさせる為だけに作ってて曲にすらなってないので完全封印。お前らには聴かせたらん！俺の立場がゆらぐっちゅーねん。ミジンコどころじゃすまんっちゅーねん。ミカヅキモまで落とされるで。モチーフはSOFT BALLETの曲で、前に勤めていた会社で流したら「イラつくからやめてくれ！」と言われた曲です。",
"現行の空の水源の曲のフレーズ違いですね。なんでこんな程度の違いで没曲としてチョイスされているかというと、この消されたフレーズを元に女神の塔をアレンジしたからです。消されたときはびっくりさ。なんせそこぐらいしかストレートにアレンジしてなかったからね。ここ消されたら原曲との共通点なくなるんじゃないか？と思ったので。よくよく考えたらどの裏曲もほとんど原曲残ってないから、まーいっか、と。",
"俺が作った空の水源の曲です。これはねぇ。GR3の時にサミエルさんのクリスタルステージの曲が人気があって。内心悔しくてねぇ。それならばメジャー狙いで俺も作って人気をかっさらうぜ！と思って作ったんです。作ったんですけどもやっぱりどこかに変な箇所が混ざってしまうわけで、変拍子があったり、どれがメロディーラインかわからない作りにしたり。duplexさんが難色を示していたのでゲームらしくメロディーを目立たせたのがこのバージョンです。でもそーなると作った時の目標が完全に消えているわけで、愛せない子供になってしまってね。結局自分で勘当ですよ。",
"迷いの門の前身バージョンです。作りとしては現行の曲とそんなに変わらないんですがー。原曲をうまく残しているでもなし、独自のインパクトがあるでもなし。なんかもう当たり障りのなさにボツにしました。それよりなにより、短すぎ。",
"こっちの方が原曲のフレーズがしっかり残っててわかりやすいんですが、サミエルさんはボツにしましたねー。俺もduplexさんも特に違和感は感じてなかったんですけど、作曲者の中には譲れない何かがあったのでしょう。改めて聴くと、現行バージョンよりこっちの方が淡々とした印象はありますわな。",
"月光聖殿っていうイメージが強い曲ですね。これも作曲者自ら没にされてますなぁ。原曲の３連符のイメージが強く残ってますね。彼は一体何が気に入らなかったのか。しきりに怨念が足りないと言っておった気がするんですが、こちらとしてはあのフィールドに怨念を込めたつもりはなくて。うーん、あのぐにょぐにょした背景かな？なんも考えずに作ってるんですけどねー。",
"没になった空の水源を元にアレンジされているので、やっぱりこれも没ですね。ひどい話だね！速攻で決まった話だったので、この曲自体をしっかり聴いてなかったりするんですが、しっかりゲーム音楽になってて他のフィールドで鳴っててもよかったかもしれんですな！後の祭り、アフターカーニバルですわ。",
"滅びの塔没です。コナミゲームから曲調の違うものをいろいろチョイスしてモチーフにしていたわけですが、コナミMSXゲームで同じく遺跡風味のあるエルギーザ系の曲を作るのを忘れていたので、なんかああいうエスニックポップスみたいなものを目指して作りました。作ったのはいいんですが、滅びの塔には結構な重要キャラクターである精霊とかジョカがいるわけです。物語も後半ですわ。そこでこんなポップな曲が流れるのはなんかちがうなぁ、って事で没にしました。気に入ってたんですけどね。",
"イメージがまとまらないまま進んだ聖母の祠の曲。このバージョンに行くまでにも２つぐらい没があります。その二つはもう何がしたいのかわからないぐらいメロディーが死んでてね。夢大陸アドベンチャーの２面をモチーフにしたこのバージョンがまぁなんとか聴けるかなっと。で、これのMIDIバージョンを作る時に曲調が別物になるほどアレンジしてしまって怒られまして。うん、もうこの子いらない。これだ！と決めて苦心して作ったのに最初のイメージから外れてしまうととたんに作品に愛情がなくなるみたいです。",
"調子にのりすぎの代表曲ですな。気に入ってるんですけどね。死滅の間の曲が褒められて調子コイた曲です。もー最初から最後まで変拍子の塊ですわ。でもなんとかゲームっぽくしようと後半に取って付けたようなメロディアスな部分が惨めですね。",
"バフォメットの没ですね。メロディーシンプル作戦決行中に作ったのでわかりやすい曲です。パイプオルガンで演奏したような、ガリウスの大悪魔戦のように徐々に音程があがっていき緊張感を高めるようなものを目指したんですけどね。音程があがる一方でループした後どうやって元に戻すか思いつかなかったので没にしました。聴いてやってくださいよ、この適当な転調を。",
"没曲なのにみんな聴いた事がある、先行公開版のラスボス曲です。自分ではね、こりゃーよく出来たと思ってたんですよ。俺の方はLA-MULANAで作曲するにあたっていろんな民族音楽をモチーフにしてたんですが、スパニッシュを使うの忘れてたなぁと思っていたわけです。それでラスボスを情熱のスパニッシュにしてしまえ！と意気込んで作ったんですが不評でした。うん、この好評不評の違いが自分でわからないのがミジンコ。でもこのバージョンで導き初侵入のイントロをアレンジするって言うアイディアだけはサミエルさんバージョンでも生き残りましたが。",
"ラスボス曲がボツになり、失意の中で作った第２弾。「これだったら前の方がいい」と言われて即ボツ。うんうん、改めて聴くと失意だらけでダメですね。ラスボスの、何度も姿を変える様をイメージさせる為に短いいろんなフレーズが交互に鳴って……うんうん、こういう余計な事を考えるからいかんのですよね。頭に来るので今この場でタイトル決めた。ネタじゃ、こんなもん。",
"サミエルさんの開発後期で公開されたもんですから、もちろん開発中に一度も聴いた事はありませんでした。存在するという事だけは聞いてましたけど。バックベアードといわず、画面をまたいでいつまでも追いかけて来る中ボスという案をサミエルさんが結構前から提案し続けていたんですが、プログラム的に結構厄介だったんです。そんな風に作ってないから。そして俺の頭の中にもいつまでたっても永遠に追いかけて来る敵ってのがイメージ出来なかったので。それでも執念でバックベアードとして実を結んだわけでたいしたもんですね。",
"ここまで小分けに店の曲を用意する必要はなかったんですが、どーせなら徹底的に作ろうと遺跡内の語り部の曲を作ったんですがー。もーまったく特徴のない曲ですね。ボツですわ、こんなもん。",
"体験版の時に開発リーダーとして！LA-MULANAはこうなのだと示す為！導きの門の曲として作ったんですが「こういう曲はもう、好きと思えませんね」みたいなコメントとともに葬り去られました。かっこいい曲を目指しつつ、また変拍子とかいらんことをしているのがとっても俺らしくて素敵ですね。タイトル？速攻ボツにされたものにタイトルなんか付けてるわけないいやろ、ボケ！",
"まだ発展途上のSSCCで作ったバージョンですねー。こうまで音が違うのかと思いますな。やっぱりゲームは５年以上かけて作るに限りますわ！カンラカラカラ。",
"おかしいぞ。これが本来空中戦で今空中戦で鳴ってるのがステージだったんだ。空中戦が第１楽章でステージの方が第２楽章だったんだ。うん、ただ単に他のクラシック曲が思いつかなかったんだけどね。ちなみに原型もとどめてないんだけどね。",
"ありましたね、これ。新世界といわれてもこっちの楽章は出てこなかったぜ。開発ラッシュ時でみんな忙しかったので、オードブルがテーブルに出されたけど談笑に忙しく、食べようと思ったら引っ込められたって感じ。あーん、まだ食べてない。"};

            samieruComments = new string[] {
"タイトルデモを組み始める直前まで存在に気付いてなかった曲です。結局先行公開版でデモ入れるかどうかって話やったのにこのオープニングが出来たのは完成直前と言うのが流石GR3Projectってとこです。ほっほっほ。 曲とデモの展開があわせてるんすが、なんかねーフレームレートが環境で結構変わっちゃって、遅れる環境やとちゃんとあいません。すまんです。 この曲はもうなんちゅうか、曲どうこうよりもデモ作る時のタイミングあわせで何回も聞いたのでそっちの思い入れが強いっすね。 鳥が上手く逃げてるように見えて良かった良かった。",
"まさかでーんでーんでーーーーんとロゴの出現をあわせて来るとは思っておるまい！とオランダでほくそえみながらタイトルデモ組みました。描画がちょいと遅れるマシンやと綺麗にあわないんで申し訳ない。だから最近のゲームって計算でやれるデモをわざわざムービーにしとるんやなぁ。俺ちゃんは「タイトル画面で曲が流れている」イメージがMSXではあまり無くて、てっきりこれがオープニングデモの曲やと思ってました。だから始めはそれで頭の中で構成組んでて、よっしゃやろか！ってなったらデモの曲がもう一個あって「マジかーーーー！！」ってなったんですわ。先に気付いてたら真聖母の曲変わってたかもしれません。マジでマジで。",
"俺ちゃんの中では「ルエミーザ博士のテーマ」って感じです。この曲は産まれてかなりの時が経ちますわ。今回俺ちゃんの作った曲の中でかなりのお気に入りです。初期の曲なんですが、途中ボスがちょっと隠し味を入れてくれただけで、そのままアレンジもほとんど手を入れてないっす。完成度は高いと思うっす。まぁ、それと言うのも元にしたのが完成度高いんすよね。「サルモン？」て言う人いますが、違います。確かに似てるんすが、これ実は「蘇る伝説」です。",
"MSXネタのテーマです。おかんが起きるとMSXネタが聞けなくなるのは寂しいですが、凄い小癪なジジイですよねぇ。お肌の調子気にしてるし。多分波紋出せますよ。",
"え！？ちょっと待って！？ネブル嬢ですか！？",
"ノータッチ？いやいや、前奏の音がボスの手でちょっと変わりましたよ。さてこれ、突然、ほんまにある日突然思いついてつけて見ました。何で思いついたかっちゅうとメトロイドなんですよ。入った時に「なんか来たー！」って言うインパクトが欲しいなぁって思ってわりとさっとつけました。はじめは毎回かけるつもりやったんすが、師匠が「この前奏ごっついので、最初だけにしましょう」って言いまして、一回だけになりました。そのお陰で最後にズバン！とこれたわけです。ズバン！ですよズバン！なんか好評なようで良かったっす。っで、long versionと言われるとなんか夢色チェイサーとかZ刻を越えてとか、とりあえず鮎川さんを思い出します。バイハー！バイハー！",
"体験版のが流石に改めて聞くとしょっぱくて、改修のすえ、出力を従来の１３０％にまで高める事に成功し、ボスがちょっと手を入れてさらに音が厚くなり、１５０％の出力に達したって感じです。アレンジもそのままです。入り口なんでガリウスっぽい勇敢な感じって話があって、ベース思いっきりデンデレデンデレ言うたら勇敢やろ！みたいなノリです。",
"実は、ちょろちょろバージョンアップされた曲ですね。どんどん豪華になりました。ボス戦ってのはこっから演出スタートなんですよ。ここは効果音で色々がんばりましたよー。師匠が上手い事つこてくれました。･･･何！？THE ALFEE！？そうか、THE ALFEEだったのか！",
"アクションだ！アクションなんだ！男はアクションが全てなんだ！でもダイイング・イン・アクションってカタカナで書かれたら意味がわからんかったぜＦＯＸ！そんな感じです。タカタカタカタカ（ピューン！）がお気に入りです。最後もピューン！です。この時は全ボス同じ曲にする予定やったので汎用的に使えそうな曲にしたんですよ。まさにアクション！ぴゅーん！",
"オールクリアの出だしもこれなのでデータ上書きしてもうたかと焦った俺ちゃんです。",
"こいつはとにかく、MIDIアレンジがヤバい。これのせいでMIDIは適当で大丈夫と言う目論見が崩れたんすよ。ただ、結局俺ちゃんのデータは適当なままなんですが･･･。La-mualanaの中で１，２を争うくらい好きな曲ですね。巨人だけはこの曲のモチーフを残したくて、ボス戦にも入れたんすよ。ストーリー的にもステージとの絡みが一番強いですしね。このノリを何度か真似しようと思ったんすが、真似るとこの形にしかならなくて「ダメだ！」とあきらめて他の道に行った曲があったりなかったり。巨人てほんとは結構悲しい物語なのになんか壮大なイメージが前に来るのはこの曲のせいかなって思います。",
"あ、やっぱり後半適当やったんすね！夢大陸の悪徳バーターがすぐに思い浮かぶ曲っすね。とりあえず、スピード勝負の店だぜ！",
"師匠が「これ鼻歌で歌えないっすよー」って言うてたんすが、俺ちゃんは結構好きやった曲です。なんか一時期双連迷宮でかかってたような気もするんすが、何時の間にか無限におって、「おー無限っぽいなー」って思った曲です。夢幻？ヴァリス？何が好きかって音の使い方なんすがね。MIDI版のやりたい放題もいいっすがSSCC版の「おお！こんな展開もありか！」が重要っす。無限は滞在時間も長くなりがちなんで曲が長いのもアリやろ思って、なんかこれも行くべくして無限に行った感じです。これよか長い曲はラスボスだけじゃないすかね。",
"MIDIアレンジをボスに渡したんすが、どうするんかなぁと思ったらそのままやって逆に凄いびっくりした曲です。マジで。この曲は巨人のモチーフがすんごい入ってます。全ボス別曲になったからにはね、やりたかったんですよこういうの。とにかく「重そう」で「でかそう」。そして「ロボ」です。ロボですよロボ！俺ちゃんロボには目が無いですからね。っで、曲全体のイメージ的には、ザ・ビッグ・オーです。結構まんまです。プワンプワンプワンプワンを入れたところくらいから「まんまでＧＯ！」みたいな。",
"いや、MIDIで長くなってはないハズっすよ。長くなったのはこのバージョンになった瞬間っすわ。しかしこれは完全な悪乗りですねぇ。なんと、ボスも師匠も元ネタ知らなくて素通りしてしまったと言う。怒られると思ってたんすが。公開した時にFM-PACの曲と言われたのはびっくりしました。後から知ったんすよ。ちなみに「伝説の聖戦士」にしようとしてたんすが、多分「虚空で復讐」のが知名度高いと思ったのと、「虚空で復讐」のがかっこいいのでこうしました。展開的には、出だしでは気付かなくて、バックで聞いた事あるようなフレーズが流れ出して、サビがまんまでシメで「うわーい！」ってなるネタです。完全版ではBメロを変えようかと思ってたんすが、思いつかずに断念したと言う情け無い裏話が。",
"マジで！？わざわざ別曲用意するとは凄まじいなぁとか思ったんすが。",
"弟に「やっぱ溶岩はイースになったか」って言われて、「ほんまや」って思った曲です。なんだかんだでイースっぽいの多いかも。これ、魂斗羅の最終面前半がイメージやったんすがね。MSX版だとサビが無くて「なんじゃこりゃー！」ってみんな切れた例のあの曲です。まぁMSX版はゲーム自体が「なんじゃこりゃー！」でしたが。ボスに対抗して変拍子なんかも入れたんすが、結局、俺ちゃんが変拍子を入れた曲で通ったのはこれだけです。んー脳みそが単純なんやなぁ。MIDIアレンジはもっとまともにやる気やって、前奏のギターも入るコード変えて展開のアイディアあったんすが、すいません、ワールドカップなもんで前後が仕事で死んでたんですよ。途中でボスに丸投げしました。すまぬ。",
"曲名の由来はMSXで河で危ない。曲のイメージとしては、「ルエミーザ博士決死の潜入作戦！謎の地底大河を調査せよ！」です。モチーフネタは凄いマイナーな曲なんですが、ヒントは「ダバダバ！ッハァー！」。まんまです。ドラムドコドコはなんちゅうか、とにかくエルマックと違うアプローチでスピード感を出したかったんすよ。っでブラスで跳ねて、それに加えてタムをドコドコ叩いてみました。叩いているうちに曲が終わった。そんな感じ。余談ですがこの曲とAncient Machineには隠し悪乗りボス曲フレーズみたいなんを入れてまして、R-TYPEが隠れてます。",
"これ、はじめは空の水源のサンプルで流れてた曲やったんすよ。その時の空の水源のジメジメ感がなかなか好きやったっすわ。で、それが気付いたらピラミッドでかかってて「えぇ！？」と思った記憶があるっす。なので最初は違和感あったっすわー。んで、始めは短かったんすよ。俺ちゃんとしては「こっから来るぜ！」ってとこで終わる印象で、どうも「スーパーで増えた新キャラの曲」をイメージしてもうて凹んだんでサビを追加してーって言うた経緯があります。この曲には後で泣かされるんすよ･･･。ほんとでなかったなぁ。",
"欲を言うなら･･･欲を言うなら覚醒したらこれの豪華版がかかって欲しかったんですよ。いや、てっきりそういう演出の布石なんだと思っていたんすわ。",
"これは･･･正直ショックでしたね。作った本人より音色使うのが５倍、いや、１０倍上手いんすよ。参った。正直参りました。超ジェラシーです。しかもあの使い方、俺ちゃんSONARつこてんすが「ソフトの特性上、やるとごっつい面倒」な技なんすよ。さらにジェラシー。くっそう、今の環境にZmusicさえアレば。ちなみにこの後ボスがボツいっぱい食らう影には「ジェラシーだよ。俺のジェラシーがそうさせたんだ。」と言う秘密があるトカないトカ！？この面は表すが曲的には裏が先に出来ていまして、ここだけ「裏」のアレンジが「表」になってます。暗いよー！怖いよー！なんすが、終盤スナッチャーのエンディングっぽくなってカレーのフレーズが出るとこヤケに渋いっすよねぇ。これまた超ジェラシーです。",
"この曲を始めて聞いた時、「これは可愛すぎないかなぁ？」と思ったんすが、実際、エルマック可愛いのでOK。でもこの巨体で凄いスピードでしかもガニマタで追いかけて来るんですよ。いやー多分、現実にはすげー怖いっすよこれ。ここのトロッコ、企画段階ではもう滅茶苦茶でした。ステージ全体を駆け巡るって言うとんでも無いボス戦でしたもん。いやーしかし、「MSXっぽくない」で最も様々なアイディアが消えたとこじゃないでしょうか。本当は分岐でルート大きく変わる予定でしたしね。",
"ドラキュラやったんかぁ！！！！！結構好きな曲ですねぇ。始め導き用で来たんすが、これが導きでかかる状況を想像すると、序盤の曲じゃないって思いません？でも絶対こいつがかかるべき場所は別にあるって考えたんですわ。双連迷宮になった時「あ、この曲は双連迷宮に落ち着く為にさまよったんや」って思うくらい落ち着いてびっくりでした。っで、「こうじゃない･･･なら･･･こうか！」って導きの曲を作ったんすよ。MIDI版は最初、序盤ってイメージがあった為か結構普通なアレンジやったんす。が、途中で単純にオケヒやったんがシンセ来て軽快さが出て、かなりジェラシーなアレンジです。",
"シャロムの海の曲がなんで入ってるんやろうと思った俺ちゃんです。すんごい長い曲なんすが、聞く回数も少ないし会話も特に長いわけじゃないし、ええんかこれー！？",
"これ出てきた時、さてどうアレンジするか凄い悩みました。結果、この曲のアレンジは修正後の１フレーズが入るだけになったんすが。アレンジの話はAwakingのコメントにとっといて、ここって入った途端なんか曲の雰囲気から「最後っぽい」じゃないすか。これって重要やなーって思うんすよ。出だしのドロドロ感もそうなんすが、この曲ってメロディ始まるとずっと不安定なんすよ。全部消えてくって言うか。これは俺ちゃんが作るの苦手なジャンルっすわ。マジで。っで、ここでボスが出してきた曲がボツになるのが何回かあるんすが、確かに音色の凄さが前に出すぎて曲として何か良くわからんかったって奴もあったんすが、基本はジェラシーです。ジェラシーでボツです。こんな音でねぇよ！って言う。",
"La-mulana全面中、最も異色なステージやと思うっす。表の原曲から遠くかけ離れたんすが、ラストに顔を出して「あ、導きの裏なのか！」って思わせる泣ける演出ですね。顔といや、背景の顔が怖すぎっすねー。この面のテーマは「怖い絵本」（by duplex師匠）やったんすがあの顔が来た時には「流石はボスだ（ごくり）」と思いましたよ。始めもっと静かで寂しい曲やって、何回か音の調整があって今の形になったんすが、はじめの静かな状態も怖かったんすよ。ただ「アクション」の曲じゃなかったっすが、アレも良かったっすわ。",
"MIDIアレンジをボスに渡したらキラキラ音がついてて「無理矢理氷にしたな！」って思った曲です。あのキラキラ音は良いですわ。この曲、正直、面のイメージからは外れてます。なんか、「氷の面てかっこいい曲多いよね！？」とか「アクション重視ステージやからアップテンポやんね！？」とか勝手な言い訳つけてゴリ押ししましたよ。でも原曲のフレーズはかなり濃く残しまして最後の締めが「よっしゃ！」っておもてんすが、一部、どっからどう聞いても「例の廃墟」になっててびっくりでした。後から気付いたんすがこれは流石にまんますぎですねぇ。っで、これで「まぁここまでまんまが入っちゃったら少々他でも入っていいよね！」って言う悪乗りが始まります。",
"個人的に本当は凄いグロイ上にエロイ状況なんだろうと思ってるバフォメットです。出現シーンのタイミングが俺ちゃんっぽいっすね。バフォメットはラムラナでは珍しい画面完全固定型ボスです。面白くするにはどうすればいいのか？かなり困りました。強くするだけなら簡単なんですが、面白くないんですよ。このバランスがムズイムズイ。最初の回避策が「フラッシュの色と効果音でバフォメットが何をするかがわかる」事。そして次に行ったのが「攻撃自体を防げる事」。完全版ではノーダメージ撃破が簡単に出来るようになっちゃったのが流石に失敗かなと思ったんすが、多分それほど悪いバランスじゃないと思うっす。ちなみに、防護服でつっこんで、ってやらんでもメイン武器だけで倒せるようにしてます。羽の攻撃判定がですねぇ･･･。裏話としては企画書では炎攻撃が「同時に上がる」事になってたんすよ。でもキャラクタオーバを起こしちゃいまして、その結果入れ替わり式になりました。",
"日本に帰って来て言われたことは、「責任持ってスリラーにしたよ！」でした。流石はボスだ！！この曲もかなり紆余曲折があります。没にした奴が結構長いことステージに定着してたんすが、どうにもねぇ、渋いとこもある思ったんすが、サビが全く納得行く形にならないし、どうも画面のイメージとステージの展開とかにあわない感じがしてずっと「違う」と思ってて、その間も色々やったんすが、元の曲がアレンジするにあたって「苦手な素材」やったんすよ。全く良いの出来なくて、ある日なんとなく久々にマイケルジャクソンのプロモ集でスリラー見てて「そうだ！この手があった！」ってなったんすわ。まず重要なのが背景の壁です。壁と中心である月光聖殿。この雰囲気のギャップ。これをどう収めるか。マッチしたとは言い難いですが、夜、スリラー、アーオ！って感じにはなったかなと。曲のイメージがアーオ！（青色）過ぎるのと、原曲がほとんど見えないのは大問題っすがね！後半なんてスリラーしたかっただけで関係性ゼロやし。アーオ！そういや、元々この曲はもっとテンポ遅かったんすが、ボスにデータの調整を頼んだら速くなって帰って来て、そのまま定着しました。",
"これは始め聞いたときはびっくりしました。音量に。でかすぎたんすよ。調整大変やったデータの一つです。でもこの面、この曲やったからか、間違いなく「暑そう」で「速い」んですよ。速すぎて見えない敵まで居ますしね！めっちゃくちゃにリズム叩かれてるのに元のスローなメロディがちゃんとわかる。結構わかりやすいアレンジっすよ。もしかしたらLa-mulanaの中では珍しい部類かも。最初あんまり好きな曲じゃなかったんですが、ステージにあわせて見るとスピード感が結構合致して「ほお」と思ったもんです。やっぱね、あわせてみないとわからんもんですわ。ゲーム音楽ってのはそうじゃないと！",
"ヴィーっすよヴィー。裏話でも書きましたが、企画にはレーザーなかったんです。っで、「おまかせ」って言われたのでレーザーつけました。吹き飛ぶ床に「何これ！？」ってボスもびっくり。「一つ目って言うたらもうレーザーっすよ！」みたいなノリです。っで、完全版に到るにあたってボスから「こうソーラレイで消し飛ぶコロニーのようなエフェクトが欲しい」となったのでアレがついたわけです。曲と画面の色と攻撃速度がマッチしてて結構上手くいったんじゃないすかね！個人的には悪魔が巻き込まれるのが儚くて好きです。それでも健気にがんばる彼らは凄い仕事熱心です。",
"核心にせまって来た！って曲っす。これ、抽象的なイメージから始まって最後に凄いメロディカルな部分もあってね、構成がかっこいいっすよね。またここは見せ方がヤバイじゃないすか。トンネルで繋がってる部分はなんかメトロイドっぽくてかっこいいですが、あそこで「何だ！？」って思っても、いけない。実際に入った時は「え！？」って思って「なんじゃこりゃー！」っすからね。冷たさと不気味さをもってステージとのマッチングもばっちりっす。曲が二転三転した箇所だけに、ばっちり来て一安心でしたよ。",
"これ、プログラム的な問題で、いや、主にMIDI音源の問題で効果音にすべきかどうかって話がありましたねぇ。MIDIで切り替わる時「ガク」っと止まる人！SBのMIDI端子のバグだから気をつけろ！",
"基本は踊るマハラジャです。ゲームらしくしようとしたらウシャスになりました。曲名は出来た時に弟が「カレーの歌やな！」って言うたからです。GR3の中でもずっと「カレー」って呼ばれてました。今回作った曲で最も「予想外に上手く行った」曲です。元々は「死滅の闇」の曲として作った事もありコミカル過ぎると考えてたんすが、なんかねぇ、産声であわせてみると凄いしっくり来ちゃって。何時の間にやら正式採用でした。ボスが曲にあわせて背景修正してくれたとも言います。まぁ、正直、ここの敵って俺ちゃんが組んでるんすが、ジャンボマッドマン（ビッグマンって言います。後半でいただきじゃ！）がこの曲で走りまわった時は流石にとんでも無い事になったなこりゃと思いまして、出現の仕方とか色々調整してもっと絵的に面白くしました。悪乗りです。いやー、こうなるならゾウにターバン巻くべきでしたかねー。",
"ボスに「パレンケどうするの？」って聞かれて「ふふ･･･インドシューティングっすよ」と宣言していた虎の子です。欧州行きの前にボスに託すと期待通りのアレンジで帰ってきた曲です。「やったー！かっこいー！（シュウマイ）」みたいな！スペースシップが鳴った時は「うわーボス楽しそうやなぁ！」って思いましたわ。ちょっとね、カレーとあまりに進行が似ちゃったとこが気になってるんすが、Dangerous Raidとこいつはマッハで組み上げるしかないスケジュールやったんで修正なしです。っで、そういう修正無しの奴の方が完成度高かったりするんすよね！なんでやろなぁ。なんかギャグっぽいとか言われますが、本人（パレンケ）はいたって真面目です。",
"死亡遊戯ゆでたまご版。これはですね、確かに古代日本やったんす。三味線ちゃんちゃか鼓ポーンで無限をのこしつつ結構渋いフレーズは出来てたんすよ。ただし！MIDIのみ。どうにもSSCCでかっこよく鳴らせなかったんです。悩んだ悩んだ。ボスにも何回か、「和風がきついんですよ」って言うたんすわ。んでその時ボスがですね、「むーん、アクトレイザーのボスラッシュみたいな感じ」って言うて「アクトレイザー！それならすぐですよ」ってこうなりました。古代日本ならぬ、古代（コシロ）日本みたいな！お、上手い事いうた！前奏しか無限が無いように聞こえますが、実はAメロは無限です。いや、まぁ、俺ちゃんはそのつもりっす。後半が完全にアクトレイザーなのと、MIDI版がSSCC用データの音色変えただけって言う酷い物になっちゃったのは勘弁してください。ワールドカップのせいです。",
"完全版だとそうはイカのなんたらですが、先行公開版だと弱すぎて絶対ソロまで聞けない。いくらなんでも不味いっすよって事で大幅修正が初めから決定していたティアマトですが、完全版開発中は結構狂ったボスでした。プログラム的にも性能的にも。でも企画段階はもっと狂ってたんです。プログラム的に。曲ですが、これ実は曲自体は結構好きなんすが、ティアマト戦と言うよりもエルマック戦っぽく聞こえるんすよね。かなりのスピード感ですし。ちなみに、データの音量がでかすぎてすんごい大変でした。音割れてたんすよ。",
"この曲は珍しく（ほんとに珍しく）最初からはっきりとしたテーマがありまして、「シャロムで最後、魔城伝説かかった時みたいな感じ」と言うのやったんす。っで、色々考えたんすよ。はじめはMother will be awakenedのアレンジ。これはスピード感出すと結構かっこよかったんすがパンチ不足。どう取っても魔城伝説のテーマがかかった時の「そこでこれ来たか！」にはならない。何故か！？単純にMother will be awakenedってそんな回数聞く曲じゃないから強く印象に残ってないんちゃうかな？って予想です。じゃー回数聞く奴だなって次に考えたのが、地上。逆にインパクト重視で導きの前奏から別の曲･･･この辺のネタが全てあっちに行くわけですが、結局タイトル画面持ってきました。意外に「お」ってはまってくれて良かったですわ。ただ、曲としては終盤の展開が気になってて変えようとも思ったんすがどうにも良いのが出てこなくて。それにMIDI版は全く違う曲にしようと企んでいたんすが、すいません、ワールドカップだったもんで。色々ワールドカップのせいです。それでも途中までやってたんすが間に合わなくて、前奏にその名残が。",
"これ、密かにタイトル画面のアレンジっすよね？いやーかなり短いんすよねこの曲。絵的にも「変形」しそうな臭いはぷんぷんしますが、ラスボスっちゃラスボスな雰囲気あるんすよねぇ。憎いねこの！まぁしかし、初めての人にはあの演出のインパクトは凄いですよ。",
"「俺ちゃんが後一曲やるとフィールドとボス戦が丁度二人で半々になる。」そんな理由もあって差し替えになったラスボスです。コンセプトはとにかく、「最後」。っで、ボツになったラスボス曲の中で地表のアレンジが入るとこがありまして「その手はいけてる！」と思って地表のアレンジに決定しました。別名「博士逆切れのテーマ」です。音色が弱いなぁって思っては居るんすが、ゲーム中だと効果音が混ざるのでそんなに気にならなくてちょっと安心しました。出だしがファイファン５のラスボスっぽいんですが、さらに「ロマサガ２のッテー！が欲しい」とか「口笛で終わるのがいっす」とか色々アイディアが入って１ループが３分４０秒もあるLa-mulana最長の曲になりました。んで曲が長くなったので元々完全版において大幅な変更が行われていたラスボスがさらに再調整入ったと言う。MIDI版をボスにほぼ丸投げ状態でお願いして、いやぁーこれはかなり熱いアレンジでした。まさに「ラスボス」ですね。しかし！ここでデータと言うか、俺ちゃんのプログラム的な問題が発覚しまして、このデータの構造だと綺麗にループしないんですよ。何かって始まるより先にギターストロークの感覚出す為に鳴ってるノートがあって、そのせいでデータ全体の拍数がずれていたんです。っで色々やった結果この曲は小節をあわせるためスタートが他の曲より０．何秒か遅れます。言われないとわかんないと思うっすが。",
"脱出シーン、時間があったらもっと色々やりたかったんすよ。ほんまに脱出させるとか。脱出って燃えません？メトロイドとかメタルギアとか沙羅曼蛇とか。",
"データばーっと確認してる時にファンファーレが二回入ってて「しまった！間違えてなんか消してもうた！」って焦った曲です。これはほんまにゲーム曲やと思うっす。昔のシューティングとかアクションゲームのエンディングっぽいですよね。ハイドライド３ってボスが言うてますが、ちょっとレイドック２にも似てますわ。ってどっちもT&Eか！コナミってなんですか？そういや例の聖戦士の曲もあるし、T&Eっぽいの多いかも。っで、このエンディングはザブングルです。誰がなんと言おうとザブングルです。と言うかボスが曲名で既に狙ってますよね。お前は走るか！？俺たちゃ走る！！",
"ゲームオーバーっすが、実は開発モードだとゲームオーバーにならないのであんまり聞いた事ない曲だったりします。マジで。博士アウトは鳴るんですが。",
"マッチョマンおったー！2004年だっけな、TNAのターニングポイントって年末興行がありまして、カードみてたらマッチョおじさんいましてね、「ホーガンの居ないマッチョおじさん、これはかなり不安やなぁ」と思ってたらやっぱり不安的中やったん思い出しましたわ。ほんとこの曲聞いたら俺ちゃんの頭の中にはランディ＝サベージしか浮かびません。ちなみに空中戦とステージが入れ替わって、さらに元々の空中戦がボツってステージの曲を俺ちゃんがやる事になったのは師匠の考えやったんすが、確かにこの曲は空中戦っすよボス。なんでって言われるとめっちゃムズイんすが、空中戦の絵が浮かぶっす。",
"この曲自体はすんごい有名でほとんどの人が聞いた事あるはずなんすが、みんな曲名は知らないって言う奴っす。はっきり言うて「えへん虫の歌」とか「マリオブラザーズ」って言った方がわかりやすいっすわ。この曲もボツがありまして、なんとPR3は結構ボツ曲があるんすよ。しかしミジンコと言えばミジンコ光線怖かったっすねぇ。ミジミジ。完全に頭おかしい世界観なのに話はシリアスでびっくりしました。バグだらけやし。知ってます？",
"パロディウス「だ！」じゃないすかね。瞑想のパオラと言われて即「マンダですか」と言うた俺ちゃんですが、内容自体はジェイムズが突撃するシーンと、パオラが結局アレで、なんか良くわからんうちに終わったのを覚えてるくらいで、当時はMSX版の人らと名前が違うとかもあって、意味わからんかったんすよねぇ。何せ「ロードブリティッシュって何？スラッシャーとサーベルタイガーじゃないの！？」ですから。でも多分ゾウィー＝ソコットじゃないのかコイツはと。なんかこの頃A列車とかなんかもだしてましたよね。",
"そういやスーファミ版ありましたねぇ。",
"これを聞いた時、「ムキメモってどこまで作るんすか！？」と思いました。ここで、歯が痛いって言い出したらBGM止めて、傷が見えたら「バァァァァン！」ってやろうかって話がありました。効果音をオマケ専用で作るのはどうか？って話になってやめたんすが、オマケでボツ曲でまくってんすよね。なんじゃーこりゃー！",
"一言で言うなら「素晴らしい」。色々こう、来ますね。すがすがしいと言うか、なんと言うか。ここでやっと、「何故SDなのか」がはっきりわかると言う。「好きとか！嫌いとか！始めに言い出した奴一歩前に出ろ！」ってのは雑談になった時、俺ちゃんの地元で流行った替え歌ってので言うとって、ほんなら師匠も「あ、それほとんど同じ！」ってなりましてね、いやいやほんま、何かとこのチームは細かいネタが被るんですが、そんなとこまで！その他「隙とか！気合とか！」ってのもありました。",
"これ、魔城伝説奇数面BGMとドッキングさせるつもりやったんすよ。結局時間なくて止めちゃったんすが。でもなんとなく「ガリウスやのに魔城でいやまぁグリーク城も魔城やねんけど、アーーー！！」ってうけるかなーと。",
"･･･ふふふ、ボスには「効果音だから入れなくて良いよ」っていわれたんすが、なんかハブるのが悪い気したので入れましたよ。んで後からコメント頼んだらなんだとー！流石はボスだ。",
"いやぁ、俺ちゃんの音色選定ミスですわ。ちなみに、魔城伝説偶数面のBGMとドッキングさせるつもりやったんです。しかし耳コピしてて思ったんすが、この曲こんなに短かったんすねぇ。",
"これ聞いた時正直引いたっす。最後の最後でこんな音出してくるんすよこのボスは！指さすなコラ！",
"うい、これに変なアレンジ加えられたら凹みますね。",
"これ聞いた時も正直引いたっす。最後の最後でこのネタ出してくるんすよこのボスは！肉襦袢・・・。",
"いやいや、何気に豪華になってて嬉しかったです。",
"これまたボスには「曲じゃないから」って言われたんすが、いや、こういうね、音色の組み合わせで違う物を表現するって好きなんすよ。っちゅうわけで入れときました。きゃはー！",
"「えーそんなイラつくかなぁ？」って思ってかけながら書いてるんすが･･･、あーこれイラつくわ！これで作業するのきついわ！思考を途切れさせてくれると言うかなんちゅうか。メロディがロングトーンなんでカバーされてますが、滅茶苦茶テンポはやいですしこれ。しかし地獄、結構さっさと見つけられた上結構さっさとクリアされたじゃないですか。「あ、ラムラナはまだギリギリ難易度低かったのかな」と思った俺ちゃんが居ますよ。",
"変えた部分なんすが、ちょっといくらなんでもこんな適当な音の鳴らし方じゃダメでしょって思いまして。実はその直前もかなり気になっていたんすが、良いのが出なかったんです。後ポイントとして、聖戦士部分が短いっす。",
"おお！懐かしい！実はこの前奏が今も生きてるんすよね。最初、サンプルの段階の時やからほんまの最初、空の水源の曲は今の太陽神殿のプロトタイプがかかってて、凄い冷たさのあるエリアやったんすよね。なんやろ、静かな地下水道って感じやったんすよ。それがほら、なんだかサルモンの地下水道ですよ。めっちゃ水の勢い強いやんここ！って言う。はじめびっくりしましたが、実はメカメカしいとこが出てくる場所やったんすねぇ。",
"今聞いてみると、迷いの門にしては雰囲気が明るいっすね。どんどん怖くなったからなぁ。怖さではこの次に現行バージョンと同じやねんけどもうちょっと静かやった奴がありまして、雰囲気違って良かったんすよ。",
"譲れなかった所は･･･まず、展開がだる過ぎて面白く無い。次にシメが完全にやっつけ仕事。そして、一番の問題が発音数規定値をオーバーしてた。それともう一つ！月光聖殿のボツもあわせると良くわかるんすが、巨人墓場から女神の塔抜けて月光聖殿行くルート、ずっと曲のイメージが近かったんすよ。これがどうにもね、ダメやろそれじゃって思ってて。ボスは「裏だし、いんじゃない？」って言うてたんすが。",
"前半の「テッテレッテ　テッテレッテッテ」てリフと後半入ったとこのメロディは気に入ってました。しかし、「音がしっくりこなかった」。ボスのテクを駆使すればいけたとこもあるとは思うんすが。次に「前半二回繰り返すのってどうよ？」。でも一回だとしり切れで、なんかね、どうにかならんかと。そして「サビが決まらなかった」。後半の入り方自体は渋いと思うんすが最後アレはダメでしょう。っで全体通すと、この面が醸し出すエグさに付いてってない。そんなとこっすわ。",
"これ、音色が全然決まってないし、アレンジも仕上がってなかったんで公開するの危ないんすが・・・・「主人公がムチを駆使して塔を登る」と言う事で、悪魔城伝説の最終面が元ネタになってます。いっくらなんでもこれじゃまんまやろうが！って言う展開が俺ちゃん的に大問題でした。なので、そのまま行っても没になった可能性高いっすよマジで。前奏がちょっと奇妙になってます。こういう事した奴は軒並みボツったかなぁ。",
"これね、俺ちゃんは凄いとあるゲームを思い出すんですよ。と言うかアレしかないんですよ。クォースです。「おークォース来た」と思ったんすが、実はエルギーザでした。最後の方で表のフレーズが刺さってくるとこ面白いっすねぇ。ラムラナがパズルゲームだったら絶対どっかで鳴ってますねこの曲。",
"夢大陸の洞窟面すか。なるほど。俺ちゃんがこの曲で気になったのはラストだけなんですよね。ラストがなんていうか無理矢理すぎっすよボス！って感じで。そう、MIDI版、単体としては悪くなかったんすがねぇ、アレはもうだって別曲ですよ。ラムラナの表と裏くらい普通に開いてましたよ。",
"実は、曲自体は嫌いじゃないんですよ。しかし、これはマジで、ほんまに、「こんな音でねぇよ！」です。後半のメロディアスな部分にわざわざ変拍子入れてるとこがボスらしいんすがあっこで変拍子はリズムを狂わされてびっくりしました。",
"ガリウスの大悪魔とか初代ドラキュラのボス戦とかである手法っすね。いやーこれは、絶対今の奴のが好きです。バフォメットの曲は今のがいいっすよ。ほんとに。俺ちゃんはボス敵の攻撃って結構曲のテンポとかと調整取るクセがあるみたいで、多分この曲やともっとバフォメット遅いです。でも、もっとイヤらしい攻撃にする可能性が高いっすね。",
"はじめ、真聖母で導きのイントロ使うつもりで、ボスに「イントロが導きのイントロで･･･」って話したら「あ、それ俺ラスボスでやってる」ってネタがぶつかってましてね、こりゃ不味いと変更した経緯があります。結局ボツっちゃったんすが、俺ちゃんこの曲自体は終わり方がもう１パンチ欲しいんすが嫌いじゃないです。でも一個、めっちゃ大きな問題があると思ってたんすよ。この曲って頭に浮かぶ映像が前奏はボス戦なんすが始まるとエンディングなんすよ。もう戦いは終わった！って言う。夕日をバックにバイクで走ってる感じです。",
"実はボス曲としては俺ちゃんはこっちのが好きです。「戦ってる感」っちゅうか「脅威感」っちゅうか。曲としては前のバージョンのが好きなんですがね。この曲は俺ちゃんに重要なネタを提供してくれましてね、ラスト、地上のフレーズが入るじゃないすか。これなんすよこれ。「そうだ！あの曲がフィールドで唯一手付かずだ！」って言うのを思い出しまして、Good Night Momとなるわけです。",
"ルームガーダー戦で曲変えるべきかな？とか思ってたのもあったんすがね。この毛玉の親父、はじめは面を変えても追いかけて来る上に謎を解かないと全身無敵と言うとんでもない奴でした。ゲートで裏に行けば逃げる事は可能なんすが。いやいやボス、プログラム的には「そのように」動ける構造になってるんすよ。動く床があるのでそこはいけたんです。問題は、画面を越えてくる時どうするか、だったんすよね。なんて言うか「どうしょうもない物に追いかけられる」のって怖いじゃないすか。それがやりたかったんす。っで、こいつが接近して隣の画面まで来たら曲が変わるようになってて、それ用の曲でした。しかし、追跡ロジックがエグ過ぎてすぐ曲が変わるのと、俺ちゃんがテストの為に作ったこの曲が大して怖くなかった事などがあってまず心の中でボツになり、そのまま本当にボツ。それでも部屋を越えて追いかけて来るってのが諦めきれずに最後の最後でのっけたわけっすわ。ただ、実装時は「怖い」よりも「なんか可愛い」敵にしちゃいました。絵はすっごい怖いすがね。曲なんですが、これ、最後がなんか、キングスフィールド１の最終階層です。",
"クセが無くて没。言わんとしてる事は良くわかりますし、確かに重要っすが、凄まじいっすなうちら。",
"あーーーーあったあった！これあった！そうやこれやん！忘れてました！",
"多分、SSCCのバージョンの違いでバランスが変わった音色もあるのでその影響も出てると思いますが、ここまでちゃうのか。こいつの出現は、まず双連の曲が導きで鳴ってた当時、師匠も俺ちゃんも「これは中盤っすねぇ」ってなったんすよ。実はその時既に「よし、なら多分、こういう曲にするべきだ！」って考えがあって、一気に作ったんすわ。だからボスの言う「何時の間にか」になるわけっす。まぁ思いっきりガリウスにしただけだったんですが。この時はまだ開発陣もMIDIが主体で、DirectMusicは実験的要素が強かったです。この頃はGR3のクリスタル面をDMで鳴らしたり、ステージ移動したら復活のイデオンが流れたり色々してました。",
"多分これは空中戦じゃないんじゃないすかね。どっちかっちゅうとステージっすよ。どう説明するのか凄いムズイんすが、なんかそんな感じっすよボス。って話をした気がします。",
"新世界は初代パロディウスでも使われてますが一番有名な第４楽章のとこなので、そこを外して次に有名な第二、第三楽章のとこで構成したんすよ。結果、「暗い」「短い」。あぁん。まぁ「遠き山に日は落ちて」ですからねぇー。それにどう考えてもステージ曲の長さじゃないですし、ノリ的にもこりゃ空中戦ですわ。つまり、これが、紛れも無いボツって事だ！"};

            naramuraCommentsEN = new string[] {
                "This is one of my favorite songs, although it is not very popular. The data itself had been in the folder since the first release version, but the demo was not ready in time, so the song was not played until the final version. I wanted to make a final phrase, so I used the El Ghiza seal stage clear song as a motif, but it's just the same as it was. I thought I changed it quite a bit. Haha, coincidence, coincidence.",
"This song has been in the works since the trial version, but since it has no features, the places where it is played are limited, and the demo would not have started even if we left it alone, it has been buried without any buzz. It started out twice as long as this one, but we decided to shorten it because if the demo was going to be played in the finished version, why wait this long? So we shortened it. That proves that we didn't think anything of it. The \"Den, den, deeeen\" part at the beginning, I made it so that the title would sound like the game \"Spelunker\" when displayed.",
"This song was done without my knowledge. I needed some kind of starting demo, and it helped that I had a nice long intro. But when I actually made it, I felt it was a little too short to walk on the map, and it was difficult to adjust. It was just a stand-alone ground track, but it ended up being rearranged at the end.",
"Like the Endless Corridor, I used a phrase from a song I wrote about 8 years ago for this song. The guitar sound, which fluctuates in volume, worked well.",
"\"BONGA\" is \"screw (Nejiru)\" in the local language, and \"WANGA\" is \"lick (Neburu)\". I made it up just now.",
"This is the version that is played when the player enters the ruins for the first time. Not at all. But this additional intro part is arranged as the intro of the last boss.",
"I can't talk about this song calmly enough. After all, it was the song that led to my downfall #1! It was a song that was finished in the demo version, and I remember that as the game was being finished, it became unbalanced with the other songs, and I added a few parts to it.",
"This song is exactly like the backing synthesizer phrase of the intro to THE ALFEE's \"Hoshizora no Distance\". Of course, the chords are different, so it's not exactly the same as the song. If you're familiar with The Maze of Galius, you will know that I wanted to create the indescribable solemn atmosphere before the invocation of the great devil.",
"It is the base of all the boss songs. It was made before I knew what it was. It was supposed to be the theme of the boss song, but Samieru-san suggested that we change the song for each boss (I think I would have suggested it even if he hadn't). I suggested that the intro be the same, because I didn't want the music to be inconsistent. However, it was difficult to arrange the introduction because of the chromaticism of the introduction.",
"I think it's very typical of me to end a song with a bass phrase like, \"N-ban-ban-ban! at the end of the song, which is very typical of me.",
"This song is based on a gamelan-style techno song I bought in Bali, and while trying to keep the SCC style tune, I thought it might be possible to make a game music with an ethnic music style, or more like ruins, based on the game content. The SCC version of this song has a terrible mistake. This song has a shuffle beat with bouncing triplets, but when I started making this song, I was making it with a normal beat. When I was working on the second half of the song, I realized, \"Is this arrangement shuffled?\" I realized that it was supposed to be shufflebeat. However, I had to recreate the SCC song data from the temporary MIDI data, which is a pain in the ass...... So, I left it as it was. The MIDI data is shuffle.",
"I imagined an old-fashioned, game-like, store song. But, well, the second half of the phrase is appropriate.",
"I wrote this song when I was running out of ideas. No, I didn't. I was struggling for ideas, so I decided to find a song that I had made a long time ago that I could reuse, so I used a dance piece I made for a play about 8 years ago. It's not suitable for games at all. The part where it's just drums and bass, I don't think I could handle that with just two tones. I was going to change it to another song as soon as I got some subtle comments about it not being game-like, but fortunately I received a rather subtle but complimentary comment about how cool the second half was, so I left it as it was.",
"The tempo of this song matches Sakito's slow and steady attack. I was in charge of arranging the song, but since I liked the tone of the original song, I arranged it as it was without doing anything unnecessary.",
"I was in charge of the empty water source song, but I sealed it off and asked Samieru-san to do it for me. It took me a while to get used to it when it first came out because it had a different groove from the one I had created. That allowed me to arrange it however I wanted. I didn't know the original, but the theme of \"Asghine\" was included in the song, and I almost arranged this part as well. I almost arranged this part, too.",
"I just wanted to do the intro, \"Hee, hee, hee\". That's all! Kyahaha!",
"I was in charge of the MIDI arrangement, and I had been thinking for a while that a heavy brass arrangement would suit the song if I arranged it myself. I followed this idea and arranged it with brass, but I regret that it didn't turn out exactly as I had envisioned.",
"I like this song. Or rather, the arrangement. The drums, drums, drums, drums, drums, drums. I was in charge of the arrangement, and I did a lot of the drums and melody. We were originally talking about the speed of this and Ellmac, and both of us had the image of F1 spirit, so we divided the work between the two of us.",
"This is a song that I have been writing since the very beginning, without any particular pyramid in mind. No, no, really. Originally, it was a bit shorter. The latter half of the song was completely missing the part where the tune changes. Samieru-san said it was too short or not enough, didn't he? The songs I made around this time were honest game music for me, and they still had the retro-game feel I struggled to acquire with GR3. Now? Not anymore.",
"I can't spare enough memory space for an 8-bit song like this. I think it took me less than 30 minutes to make this simple song. I think I'm better at creating game-like songs when I take this stance.",
"It was the song that somehow \"grabbed\" me about how to use SSCC. To be more specific, none of the songs I had written up to that point had a tempo as slow as this one. If the tempo is fast, you can cover up a lot of things with a flood of sound, but if it is slow, the good and bad of the phrasing will stand out, and the dullness of the tone will also be noticeable. Therefore, I always add volume increase/decrease or shaking to long notes, and since there are only long notes, I add small phrases in the background to avoid selecting similar sounds in terms of waveforms. I thought about it quite seriously and composed the music. I was praised for this, so I got carried away for a while and got a lot of submissions.",
"A trolley, a fusion like T-SQUARE! The speed of a magic chariot from Romancing SaGa 3! This is what I came up with. The melody line is very fusion-like. I thought, \"If the bass and drums are chopped up, why can't I get a sense of speed? That was my simple idea.",
"A song that was ready early on but kept wandering around without finding a place to settle in. Originally, it was the gate of guidance. We went to the infinite corridor and settled on the twin labyrinth. I decided to use this song as a reference from the MSX Konami game music series so as not to have the same tune in each song and not to spoil the Konami style. The \"tête-à-tête\" part at the beginning and the backing piano phrase. If it's this limited, people won't think it's a pastiche. Mmm-hmm.",
"I made this piece when I was reflecting on my tendency to make complicated music. It's a song about \"Grieg's Castle\" and \"The Sea\" by Moro Shalom. I wanted to make a song that has a pleasant sound that stretches and sways. I am always making messy music, but surprisingly, I also like this kind of music. I feel sorry for the four wise men. They are the lowest of the low.",
"This is another song with twists and turns. I originally imitated the atmosphere of a song that was played on an NHK Silk Road special or something. Even so, I didn't like the subtlety of the melody in the latter half of the song, so I retracted it early on, saying it was just a temporary song, even though I had already created it in the early stages of development. The music for \"The Shrine of the Virgin\" was changed four times, but none of the changes felt right, and when duplex said, \"I like that song, and I had that song in mind when I was making the gate of the lost,\" I said, \"Really? （I thought of that song when I was making the Lost Gate. Of course, I fixed the subtle parts in the latter half of the song.",
"This song also took a lot of work to reach this form. I had to create a sense of wonderment by saying \"I'm lost,\" and I still had to arrange the song for that brave leader. The motif is from the Grasshopper 2 Temple stage, and I created it in the first phase of the arrangement work. At first, I just kept the melody of the guidance and made it creepy. It was too poor, so I made it more like a temple stage tune, and it was also oddly short, so it took this form. I found myself in 3/4 time, and although I tried to keep the phrases of the original song, when I listened to it objectively, I couldn't recognize the original song at all. All that remains is the repetitive pattern after the climax of the song.",
"I was in charge of the MIDI arrangement; I was given a tentative MIDI for the SCC version, and the data was already a rock song with guitars in the backing. I arranged it as a rock song for MIDI without thinking about it, but when I thought about it, I realized it was an ice stage. It was a cheap but effective way to make it more icy by increasing the number of sparkling tones. I was not satisfied with just that, so I also used a \"punch\" tone to express my wish that the giants would hit me on the giant stage.",
"The motif of this one is the same as the Tower of the Goddess. I tried to make a gothic music with harpsichord. I don't feel like I'm trying to make game music at all...maybe it's because the SCC version has a tonal problem, or maybe I didn't make the music to match the tone, but it doesn't sound ideal at all. I was told, \"It's a quiet song, so I thought you wanted me to make it loud for the production! I am now making up for it with the MIDI version.",
"I am in charge of MIDI arrangement. In the late stages of development, Samieru-san told me, \"This song is actually Michael Jackson's Thriller! While I was in charge of the arrangement, Samieru-san was overseas, so I couldn't get confirmation from him. I don't know if this is what he wanted or not, but I added some things that reminded me of a thriller, like the sound of a door closing or a dog barking, to make it sound more like a thriller. It couldn't be helped, could it?",
"I like this one too. The graphics have changed, but the field originally had a mechanical feel to it, so I made it with techno type phrases. the MIDI version changes the bass line and makes the hard distortion guitar sound simple. Hmmm, I like it. It is my favorite SOFT BALLET style arrangement. The rhythm and beat are different from the original, but I think I did a good job of arranging it so that the original is still recognizable. When I was working on this, I was trying to keep myself from messing up the melody line, so I kept the melody simple. The first half is very simple.",
"It is a collection of simple phrases created based on the reflection of \"I wasted a lot of time complicating the melody, and this is not what game music is supposed to be about. But I couldn't hold back, and the drums are playing over and over and over and over. I just can't stop myself from playing something. It's a disease, a disease.",
"I am confident that I have achieved a good balance both musically and as a game song. The motif of this song is not related to the game at all, but it is a hard rock song by MALICE MIZER (after Gackt left the band) with a cembalo playing. I like this kind of tonally elaborate music. It is the sound of \"telorello telorello\" that keeps playing in the background throughout this song. I forced myself to change the chords while keeping the melody as it is. It's fun, isn't it? The fact that it is a game song while thinking about this must be because MANA-sama is a game fanatic. When you get excited while making a song, you can easily create a song without using your head.",
"This is another song that is unique to the game. Surprisingly, it's not hard to create something like this. What is it? Am I suited for it or not?",
"Curry. People say it's BGM for a comical game if it's bad, but I was the one who gave the go-ahead. I had it MIDI-arranged, and I used ethnic percussion instruments to give it a curry flavor. I should have at least made an enemy character with a turban.",
"As you can hear from the MIDI version, I had a lot of interesting motifs and ideas. I layered a lot of creepy sounds on top of each other. The most extreme example is the \"spaceship,\" which is a tone that would never normally be used because it's an ancient spaceship. It's a sound that is made in the back of the ship, like a \"mmmm pishooooooooooooooooooooooooooooooooooooooooooooooooooo. It's very cheap, even for me.",
"I believe I offered it as \"Ancient Japan.\" I also offered to play a song that would stir up a series of mid-boss battles. Where did Japan go? However, I think it was a good decision, because the shamisen would have been a bit dull in the latter half of the stage. I was wondering what they were imagining when I heard the SCC version, but now that I hear the MIDI version, I can understand it better.",
"The synthesizer phrase \"pah, pah, pah, pah,\" sounded in small increments. I was on my way to work when I heard a song from a bowling alley commercial on street corner TV, and it was around the time I was thinking, \"I can't think of Tiamat, but I don't have time\", so I got the phrase. I had only heard it once, so even if I tried to copy it, it wouldn't be the same! I thought. Like Baphomet, this one didn't sound ideal for SCC. I thought I was making a game-like song, but when it got close to 3 minutes long, there was a guitar solo in the latter half of the song, etc. I am not a suitable person for making game music at all. I made the MIDI version as a humiliation, aiming for an ethnic hard arrangement of THE ALFEE's ARCADIA, mixing hard rock with ethnic instruments. What the heck, I'm just going out of my way for my own taste.",
"The song on the ground, or the title track, or the song that should have been written as a stand-alone piece without any back and forth, but before you know it, it's being used as a story for an arrangement. So, I'm not surprised that that title tune, which I made up at random, came back to rock! As I recall, I made an offer to the team: \"A song that will induce a sense of elation, like the song from The Legend of Majojo 3 Shalom that plays during the final battle!\" I remember I made an offer to him.",
"This is another song with no power. It was done quickly. If you don't think about it, it's quick. If you do anything else, it takes a long time and it gets lost.",
"When I went to Tokyo to visit Samieru-san's house to see how he was doing, he played me a pre-tuned version of this song. However, at that time, I had already received two rejections in a row for the last two songs, so I was in the mood for \"Whatever...\" I was in the mood to do whatever I wanted to do. I was in charge of arranging the song, but it was a very long song, so if I arranged it in a strange way, I would only make it harder for myself, so I arranged it straightforwardly. Still, I couldn't get rid of the regret of the double rejection of the rasbos, so I arranged it in Spanish, which I was going to do for the first song after the rasbos' downfall. Leave a little bit of that smell in the air! So I added an acoustic guitar. Ha-ha-ha, it's an alfie formation. We did it!",
"I don't see any difficulty in this kind of thing. I wonder if actual game music composers also get the go-ahead for this kind of impromptu production. But, since everyone is in the final stages of writing a song, it is easy for them to just pass it by without much checking.",
"I had to repeatedly create, erase, play, and stop in front of the music composition software. It was hard to decide what kind of song to make. At first, I tried to make it sound like the ending of Snatcher with the sad saxophone, but it didn't sound like a game at all, so I gave up. Next, I thought about making it like the ending of Indie John's, but it turned out to be Hyde Ride 2 no matter what I did, so I gave up. I went back to my original idea of making game music and started to make a song with the ending of Grasshopper 2, but it turned out to be the ending of Hydride 3. I've been making MIDIs for Hydride 3 and other games on the MSX site, so when I make a MIDI, I tend to end up with something more like that. What is Konami?",
"I was able to do it easily without thinking. If you are not particular about it, you can make it very fast. The only thing I had in mind early on was that he was a dandy, so the saxophone is the basic melancholy game over.",
"Oh my, it was supposed to be made into an in-stage song. Before I knew it, it was turned into an aerial song. I'll say this now. Right before the release of the finished version, my influence was as small as that of a daphnia. I didn't do anything wrong, but before I knew it, it had become, \"Oh, no, what about the aerial battle I made? I was a decorative leader. I'm just a decorative leader. He's not a king, he's a symbol.",
"Yeah, yeah, this is how a parodius arrangement should be. Take a well-known phrase and mix in a new phrase to fit the shooter. Everything I've made is just like that. Well, it's okay, it's just daphne.",
"I found out later that this \"sword dance\" was already used in the original Parodius. But that one had a Goemon Japanese arrangement. The latter half of the phrase is very Parodius-like and Konami-like, and I like it a lot. I don't know how many people know the original. I wonder how many people know the original.",
"I played the SFC version of Tokimeki Memorial from the beginning (don't ask me why I have it), even though it was near the end of development, and picked up songs that I could use ......, but I didn't record them, nor did I listen to them when I made the MIDI. I have forgotten the songs I heard when I made the MIDI, so I just chose the first song that played, in other words, the song that I could check the most quickly. It's just the same song. It's a different song because the phrasing is different. What are you talking about?",
"This is a TokiMemo confession song. Of course, the phrasing is different. So, what was I thinking, \"I'm going to make a great song that will make you cry! And so, the song is a long one. Why are you wasting your efforts like this?",
"This is an offer from duplex, asking me to mix a battle song from SD Snatcher with a song from Tokimemo. It's called \"Su-Ki-To-Ka, Kirai-To-Ka\". The first thing I had to do was to find this song, which I had never heard before. Once I heard it, the rest came quickly. Especially for this kind of story-like stuff. By the way, this song has lyrics, and I wanted to display them during the battle if there was room. So I'm going to show them here. (Intro) Yes!　The first one to say, \"I like you or I don't like you,\" is the one who will be the first to say it.",
"Hey! Why did you start with the intro to The Legend of the Magic Castle!",
"I couldn't copy by ear, so I searched the net for a MIDI of Galius, but I made it myself a long time ago.",
"I guess it was difficult to get the image of the original song with SCC.",
"That sound from PSG in SCC! It's an MSX user's dream. I tried to add more depth to the original without arranging it unnecessarily. I tackled it!",
"This is another thickened version of the original song. Hmmm....no other modifications should be made to this song, this is a song that should not be modified in any other way.",
"I made it on the spur of the moment, directly modifying the data without even creating a MIDI. Even the Bonnie Dragon lintel was created on the spur of the moment.",
"I have nothing to comment on!",
"I made this piece thinking of night sounds that I could make with SCC tones. It also helped that I had made a \"wow\" sound with a Gekko-Seiden MIDI arrangement just before. Think about it calmly, bell bugs in the jungle at night!",
"The goal of this song was to make the song impatient and frustrating as you play hell. There is one song that I finished adjusting completely before this one, but that one is not even a song anymore because it was made just to irritate me, so I sealed it off completely. I don't want you guys to hear it! My position is shaken. It's more than just daphnia. I'm going to be dropped down to Mikazukimo. The motif is a song by SOFT BALLET, and when I played it at my former company, I was told \"Stop it, it's irritating! I was told to stop playing it.",
"It is a phrase difference from the current empty water source song. The reason why it is chosen as a lost song is because I arranged the Tower of the Goddess based on this erased phrase. I was surprised when it was deleted. After all, that was the only straight arrangement I had done. I thought, \"If this part is erased, there will be nothing in common with the original song. I thought. But when I thought about it, there were almost no original songs left in any of the back tracks, so I thought, \"Oh well.",
"It's a song I wrote for the empty water source. This is because Samieru-san's Crystal Stage song was popular during GR3. I was so frustrated inside. So I thought, \"Let's make a song for a major label and steal the popularity! So I made it. I made it, but there were still some strange parts mixed in, like the odd time signatures and the way it was hard to tell which was the melody line. duplex had some difficulty with this, so I made the melody stand out like a game. But then, the goal I had when I made the song was completely lost, and I became an unlovable child. In the end, I disowned myself.",
"This is the predecessor version of the lost gate. It's not that different from the current song in terms of production. It doesn't retain the original song well, nor does it have its own impact. I rejected it because of its blandness. More importantly, it's too short.",
"This one is easier to understand because the phrasing of the original song is still there, but Samieru-san-san rejected it. Neither duplex nor I felt any particular discrepancy, but there must have been something in the composer's mind that he could not compromise. When I listen to it again, I get the impression that this version is more lighthearted than the current version.",
"This song has a strong image of \"Gekko Seiden\". The composer himself has also lost this piece. The image of the triplet in the original song is still strong. I wonder what he didn't like about it. I think he was always saying that there was not enough grudge, but I didn't mean to put any grudge in that field. Well, is it the squiggly background? I made it without thinking about it.",
"It's arranged based on an empty water source that was forfeited, so it's still forfeit too. That's terrible! It was a quick decision, so I didn't really listen to the song itself, but it could have been game music and played in other fields! It's a post-festival, after-carnival thing.",
"It's the Tower of Doom's death. I had chosen a variety of different tunes from Konami games as a motif, but I had forgotten to make an El Ghiza-type tune, which also has a ruins flavor, from a Konami MSX game, so I made it to be something like that kind of ethnic pop music. It's good that I made it, but there are spirits and Joka, who are quite important characters in the Tower of Doom. It's the second half of the story. I thought it would be strange to have a pop song like this playing there, so I decided to scrap it. I liked it, though.",
"The music for the Shrine of Our Lady's Shrine proceeded without a coherent image. There are about two submissions before I got to this version. The melody of those two was so dead that I didn't know what I wanted to do anymore. This version, which is based on the second side of Yume Tairiku Adventure, is the one I thought I could manage to listen to. When I made a MIDI version of this, I arranged it so much that the tune became something else, and I got angry. I was pissed off because I had arranged it so differently when I was making the MIDI version. This is it! I decided that I didn't need her anymore, and I worked very hard on it, but when it deviates from the original image, I lose all affection for the work.",
"It's a typical song that's too much in tune. I like it, though. It's a song that was praised by the audience during the \"death and destruction\" period, so I got carried away with it. It's a mass of odd time signatures from the beginning to the end. But the melodious part in the latter half of the song is miserable, as if they tried to make it sound like a game.",
"It is the immolation of Baphomet. It's an easy piece to understand because I wrote it while I was in the middle of deciding on Operation Melody Simple. I was aiming for something like a pipe organ piece that would gradually rise in pitch and increase the tension, like Galius' Battle of the Great Devil. I couldn't think of how to restore it after looping it while the pitch was rising, so I lost it. Please listen to this random modulation.",
"This is the raspy tune of the pre-release version, which everyone has heard before even though it is a dead tune. I thought it was very well done. I used various ethnic music motifs in my La-Mulana composition, but I forgot to use Spanish. So I thought, \"Let's make the last boss Spanish with passion! But it was not well-received. I don't know the difference between the popularity and the disapproval of this version. However, only the idea of arranging the introduction of the first invasion survived in Samieru-san's version.",
"This is the second piece that was created in the midst of disappointment after the last boss song was rejected. The second piece was rejected after the last boss song was rejected. When I listen to it again, it is full of disappointment. The short various phrases sound alternately to make you imagine the way the last boss changes his appearance many times. ...... Yeah, it's not good because I think about unnecessary things like this. I'm so pissed off that I decided on the title right here and now. It's a story, like this.",
"Since it was released in the late stage of Samieru-san's development, of course I had never heard of it during development. I had only heard that it existed. Samieru-san had been proposing the idea of a mid-boss, not a backbeard, but a mid-boss that straddles the screen and chases after you forever, for quite some time, but it was quite troublesome from a programming point of view. Because I didn't make it that way. And I couldn't picture in my mind an enemy that would chase after you forever and ever. Still, it was a persistent effort that bore fruit as a backbeard, and I'm very proud of it.",
"I didn't need to prepare the music for the store in such small parts, but I decided to make a thorough song for the storyteller in the ruins. It is a completely featureless song. It was rejected.",
"As the leader of the development team at the time of the trial version, I wrote a song for the guiding gate to show what La-Mulana is all about! I wrote it as a song for the Guiding Gate, but it was buried with a comment like \"I don't think I like this kind of song anymore. It's very nice that you're trying to make a cool song, but also doing something that doesn't involve odd time signatures or anything like that, which is very much like me. The title? I wouldn't give a title to something that was rejected so quickly, you idiot!",
"This is a version made with SSCC, which is still in its infancy. I wonder how different the sound is. After all, a game should take more than 5 years to make! Kara-kara-kara.",
"That's crazy. This was originally the aerial battle, and what's sounding now in the aerial battle was the stage. The aerial was the first movement and the stage was the second movement. Yeah, I just couldn't think of any other classical music. I couldn't even keep the original form, by the way.",
"There it is, isn't there? Even though it was called the New World, this movement didn't come out of this one, man. It was the rush hour of development and everyone was busy, so hors d'oeuvres were served on the table, but we were too busy chatting and laughing, and when we were about to eat, they pulled us away. Aah, I haven't eaten yet."
            };

            samieruCommentsEN = new string[] {
                "I was unaware of the existence of this song until just before I started assembling the title demo. After all, GR3Project was just about to include the demo in the pre-release version, but this opening song was created just before the completion of the project. Hohoho. The song and the development of the demo are in sync, but the frame rate changes a lot depending on the environment, so it doesn't match properly in a slow environment. Sorry about that. I listened to this song many times for timing when I was making the demo, so I have a strong attachment to it. I'm glad the bird seems to be escaping well.",
"You don't expect us to match the appearance of the logo with \"dee-dee-dee-dee-dee-dee-dee\"! I made the title demo while gloating in Holland. I'm sorry to say that the drawing doesn't match well on a machine that is a little slow. That's why modern games make movies out of demos that can be done with calculations. I didn't have the image of \"a song playing on the title screen\" on MSX, and I thought this was the song for the opening demo. So I started out with that in mind, and then I thought, \"Okay, let's do it! Then I found another demo song, and I thought, \"Really? I thought. If I had realized it first, I might have changed the song for the True Virgin. Seriously, seriously.",
"In my mind, it's like \"Mr. Lemeza's Theme\". It's been a long time since this song was born. It's my favorite among the songs I wrote for this project. It is one of my early songs, but the boss added a little secret taste to it during the process, and the arrangement was almost untouched. I think it has a high degree of perfection. Well, the original version is also highly finished. Some people ask \"Solomon Shrine? [YS 1&2]\", but it's not. It is true that they are similar, but this is actually \"The Legend Revived [King Kong 2]\".",
"This is the theme of MSX stories. I miss hearing MSX stories when momma wakes up, but he is a great little old man, isn't he? He's worried about his skin. Maybe I can make a ripple.",
"Eh?! Wait a moment!! Is this referring to Miss Nebur?!",
"No touch? No, no, the boss' hand changed the sound of the prelude a little. Well, I came up with this one day out of the blue. I came up with the idea because it's a Metroid. I wanted it to have an impact when you enter the room and say, \"Here comes something! I wanted it to have an impact, so I put it on rather quickly. Initially, I intended to play this version every time, but my master said, \"The last performance was too much, so let's only play this version the first time. Thanks to that feedback, I was able to play it at the end with a bang! I was going to play it the first time. ZBANG! That's right, \"ZBANG! I'm glad it seemed to be well received. Also, the long version reminds me of Yume-Iro Chaser or Zeta Gundam - Toki wo Koete... or at least Ayukawa-san. Bye-ha! Bye-ha!",
"The demo version was so dull that after some renovation, they succeeded in increasing the output to 130% of the previous version, and the sound was thickened even more with a little work by the boss, reaching 1.50% of the output. The bosses did a little work and thickened the sound even more, reaching 1.5 percent output. The arrangement is still the same. The entrance was to be brave like The Maze of Galius, so I said, \"If you say the bass is brave, you should be brave! It's like that.",
"Actually, the song has been upgraded a bit. It has become more and more gorgeous. The boss fight starts from this point. We did a lot of work on the sound effects here. The master did a great job. What? THE ALFEE? Oh, so it was THE ALFEE!",
"It's action! It's all about the action! Action is everything to a man! But if you wrote \"dying in action\" in katakana, I didn't know what it meant, FOX, that's how it is! Takatakatakatakatakataka (pewwww!) is my favorite. is my favorite. The last one is also a pew! The last one is also \"Pew! At the time, I was planning to use the same song for all the bosses, so I chose a song that could be used universally. It's just action! Peww!",
"I was in such a hurry that I thought I had overwritten the data because this was the start of the all-clear.",
"Anyway, the MIDI arrangement of this one is bad. This song is so bad that it destroyed my idea that MIDI arrangement would be fine. I like this song so much that it is one or two of my favorites in La-mualana[sic]. I wanted to keep the motif of this song only for the giant, so I included it in the boss battle. It's also the most intertwined with the stage in terms of the story. I tried to imitate this groove several times, but when I tried to copy it, I could only get this shape, so I gave up and went the other way. I gave up and went the other way. I think it is because of this song that I have a grand image of \"Giant\" in front of my mind even though it is really a sad story.",
"Oh, I knew it was appropriate for the second half! The song immediately reminds me of the bad barter from Penguin Adventure. Anyway, it's a speedy store!",
"My teacher said, \"I can't hum this song,\" but I liked it a lot. I think it was playing at Souren Labyrinth for a while, but before I knew it, it was at Mugen, and I thought, \"Oh, this song sounds like Mugen. Dreamscape? Varys? What I like about it is the use of sound. This kind of development is also possible! is important. I thought it was possible to have long songs in Infinite because the time spent in Infinite tends to be long, so I felt like I had to go to Infinite. I think only the last boss has a longer song than this one.",
"I gave the MIDI arrangement to the boss and wondered what he would do with it, but he just went ahead and did it. Seriously. This song has a lot of motifs of giants in it. I wanted to do this kind of song since all the bosses are different. Anyway, it looks \"heavy\" and \"big. And it's \"robot. Robots, robots, robots! I'm a sucker for robots. And the image of the song as a whole is \"The Big O.\" It's pretty much exactly the same. It's pretty much exactly the same. It's just like \"Go as you are!",
"No, MIDI did not make it longer. It became longer the moment this version was released. However, this is a complete bad joke. The boss and the master didn't know the original story and passed it by. I thought they would be angry. I was surprised that they said it was an FM-PAC song when I released it to the public. I found out about it later. By the way, I was going to use \"Legendary Seishi,\" but I thought \"Vengeance in the Void\" was probably better known and \"Vengeance in the Void\" was cooler, so I went with that. I didn't notice it at the beginning of the song, but I heard a phrase I've heard before in the background, and then the chorus came in and I was like, \"Wow! The complete version changes the B-melody. I was thinking of changing the B melody in the complete version, but I couldn't think of anything and gave up.",
"Seriously? I thought it was amazing that they went to the trouble of preparing a separate song.",
"My brother said to me, \"I guess lava has become Ys,\" and I thought, \"Really,\" to this song. I thought to myself, \"Yes, that's right. This song was inspired by the first half of the last page of \"Soul of the Dragon,\" but in the MSX version, there was no chorus and everyone said, \"What the heck! The MSX version has no chorus, and everyone snapped. Well, in the MSX version, the game itself was \"What the hell! but the MSX version was \"What the heck is this? I added some odd time signatures to compete with the boss, but in the end, this is the only song with odd time signatures that passed my test. I had an idea to do a more proper MIDI arrangement, and I had an idea to change the guitar chords in the prelude, but I'm sorry, I'm a world cup player, and I was dead in the work. I threw it to the boss in the middle of the song. Sorry.",
"The name of the song comes from MSX, dangerous on the river. The image of the song is \"Dr. Lemeza's desperate infiltration mission! Investigate the mysterious underground river!\" The motif of the song is a very minor song. The motif story is a very minor song, but the hint is \"Dabba dabba! Ha ha! It's exactly the same. It's exactly the same. I wanted to create a sense of speed with a different approach from Ellmac's. So I used brass to make it bounce, and then added toms to make it pound and pound. So I used brass and bounced around, and also pounded on the toms. The song ended while I was banging on the toms. That's how it went. As a side note, this song and Ancient Machine have a hidden bad ride boss phrase, and R-TYPE is hidden in them.",
"This was the first song that was played in the sample of the empty water source. At that time, I liked the gloomy atmosphere of the empty water source. Then I noticed it was playing in the pyramid, and I remember thinking, \"What? I remember thinking, \"What? So I felt uncomfortable at first. And it was short at first. I was under the impression that it would end with \"Here we come! I had the impression that it ended with \"Here it comes!\", which made me think of \"a song about a new character that was added to the supermarket\", so I was depressed and asked to add a chorus. This song made me cry later on.... I really wish I hadn't done that.",
"If I had my way... if I had my way, I wanted a gorgeous version of this to be played when I awakened. No, I thought it was just a milestone for that kind of performance.",
"This was... a shock, to be honest. He was five, no, ten times better at using tones than the person who created them. I was overwhelmed. To be honest, I'm here. I'm super jealous. Moreover, that usage is a very troublesome technique, due to the characteristics of the software, as I am a SONAR expert. I'm even more jealous. Damn, if only I had Zmusic in my current environment. By the way, after this, the boss was rejected by a lot of people, and he said, \"It's Gelashii. It's my jealousy that made me do it.\" Is there a secret to this? This side is represented, but in terms of the music, the reverse side was made first, and only here the arrangement of \"reverse side\" is \"front side\". It's dark! It's scary! But the end of the song is like the ending of Snatcher, and the curry phrase comes out, which is really cool. It's also very jealous.",
"When I first heard this song, I thought, \"Isn't this too cute?\" But then I saw this huge body chasing after me at great speed and with a crabby mata. I think it would be very scary in real life. This trolley was a mess in the planning stage. It was a ridiculous boss battle, running around the entire stage. But I think this is where we lost the most ideas because it was \"not MSX-like. In fact, the route was supposed to be changed by branching.",
"I didn't know it was Dracula. ！！！！！ I like this song a lot. I started out with it for guidance, but when I imagine the situation in which it is played in guidance, I don't think it's the song for the beginning of the show, do you? But I thought there is definitely another place where this song should be played. When I got to the twin labyrinth, I was surprised at how calmly I thought, \"Oh, this song wandered around to settle down in the twin labyrinth. Then I thought, \"Not like this...then...this...then...this...then...! At first, the MIDI version was a fairly normal arrangement, perhaps because I had an image of the beginning of the song. But in the middle of the song, a synth came in and made it more lively, and the arrangement is quite girly.",
"I'm the one who wondered why Shalom's Sea song was included. It's a very long song, but I don't listen to it often and the conversations aren't particularly long.",
"When this came out, I was very worried about how to arrange it. As a result, I ended up arranging this song with only one revised phrase. I'll save the arrangement for Awaking's comment, but as soon as you enter this section, the atmosphere of the song makes it sound like the end. I think this is important. The same is true of the sludgy feeling at the beginning of the song, but once the melody starts, it's always unstable. It's like everything disappears. This is a genre I'm not good at making. Seriously. There were a few times when the boss rejected a song that I had submitted, and it was true that there were some songs that were too much in front of the greatness of the tone and I couldn't really understand what the song was about, but the basic idea was Gerace. But the basic idea was Geraci. It doesn't sound like this! I say, \"It doesn't sound like this!",
"I think this is the most unique stage in all of La-Mulana. It was far away from the original song on the front, but it was a crying performance that made the audience think, \"Oh, so it's the back side of the lead-in! It is a crying performance that makes you think \"Oh, is it the backside of the guidance? The face, or rather the face in the background, is too scary. The theme of this piece was \"Scary Picture Book\" (by duplex master), but when that face appeared, I thought, \"That's the boss! It started out as a quieter, lonelier song, and after a few adjustments to the sound, it took shape as it is now, but it was scary even in its initial quiet state. It wasn't an \"action\" song, but it was good, too.",
"When I handed the MIDI arrangement to the boss, it had a sparkling sound and I thought, \"You forced me to put it on ice!\" I thought, \"You forced me to make ice! That sparkling sound is good. To be honest, this song is not what I had in mind for the mask. I thought, \"There are so many cool songs for ice masks, aren't there? or \"It's an action-oriented stage, so it must be up-tempo, right? I pushed it with my own excuses. But I kept a lot of the phrases of the original songs, and the final ending was \"Yes! I was surprised to hear that part of it was \"the ruins of that place\". I realized afterwards that it was too much like the original. And now, the bad ride begins, \"Well, if it's so well done, it's okay to do a little something else, too! And so the bad ride begins.",
"Personally, I think that the situation is really very grotesque and erotic. The timing of the appearance scene is very me-chan. Baphomet is a boss with a completely fixed screen, which is rare in Ramrana. How to make it interesting? I had quite a bit of trouble. It's easy to just make it stronger, but it's not interesting. This balance is muzuimuzu. The first workaround was to \"know what Baphomet does by the color of the flash and the sound effect. And the next thing I did was to prevent the attack itself. I thought it was a mistake to make it so easy to defeat Baphomet with no damage in the full version, but I don't think it's a bad balance. By the way, you don't have to use a protective suit to defeat them, just use your main weapon. The feathers are not so good.... The backstory is that in the proposal, the flame attack was supposed to go up at the same time, but it caused a character overload. But we had a character overload, and as a result, it became interchangeable.",
"When I came back to Japan, all I was told was, \"I made a thriller with responsibility!\" It was. Quintessential boss! This song also has quite a few twists and turns. The one that I had rejected had been on the stage for quite a long time, but I thought it was a bit too austere, but the chorus was not satisfying at all, and the image on the screen and the development of the stage didn't seem to match, so I kept thinking it wasn't right. I was trying various things during that time, but the original song was not my favorite material for arranging. I couldn't make anything good at all, and then one day I was looking at Michael Jackson's Thriller promo collection for a while, and I thought, \"Oh yeah! I knew how to do that! I thought, \"I've got it! The first important thing is the background wall. The gap between the wall and the center of the room, the Gekko Sacred Temple. The gap between the two atmospheres. How could we fit this in? I can't say it was a good match, but it was a night, a thriller, ah! I think I got the feeling of \"Aao! The image of the song is too \"Aao! (blue) and the fact that the original song is almost invisible is a big problem. The second half of the song was just a thriller, and there was no relationship between the two. Aao! Well, this song originally had a slower tempo, but when I asked the boss to adjust the data, he came back with a faster tempo, and it just stuck.",
"I was surprised when I first heard this. The volume. It was too big. It was one of the hardest data to adjust. But this surface is definitely \"hot\" and \"fast,\" probably because I played this song. There are even enemies you can't see because it's so fast! The rhythm is beaten so hard, but the original slow melody is still recognizable. It's a pretty easy arrangement to understand. Maybe it's one of the rare ones in La-Mulana's repertoire. At first I didn't really like the song, but when I played it on stage, I was surprised at how well it matched the speed of the song. You never know until you play it together. That's how game music should be!",
"It's Vee, Vee. As I mentioned in the back story, there was no laser in the project. But they asked me to leave it to them, so I put a laser on it. The floor blew up, and even the boss was surprised. The boss was surprised. The boss was surprised and said, \"If you say it's the first one, it's already a laser! It was like that. Then, when we were making the full version, the boss said, \"I want an effect like a colony being erased by a solar ray,\" so that's why we added it. I think it worked out pretty well, with the song matching the colors of the screen and the speed of the attacks! Personally, I like the fleeting nature of the demons involved. Still, they do their best to stay healthy, and they have a great work ethic.",
"We're getting to the heart of the matter! This song starts with an abstract image and ends with a great melodic part. It starts with an abstract image and ends with a great melodic part. Also, the way it's presented here is really cool. The part where they are connected by a tunnel is kind of cool in a Metroid-like way, but you shouldn't be thinking \"What? but you shouldn't be thinking that. When you actually enter the tunnel, you think, \"What? and \"What the heck is this? I'm like, \"What the heck is this? The coldness and eeriness of the music matched perfectly with the stage. It was a relief that the song came out perfectly, since it was the only part where the song changed two or three times.",
"There was a discussion about whether or not this should be a sound effect due to a programmatic problem, or mainly a MIDI sound source problem....",
"Basically, it is a dancing maharaja. When I tried to make it sound like a game, it became Ushas. The name of the song came from my brother's comment when it was written, \"It's a curry song! It was always called \"Curry\" in GR3. It is the most \"unexpectedly successful\" song I wrote this time. Originally, I thought it would be too comical since I had written it as a song for \"The Darkness of Death and Destruction,\" but when I tried to play it with my voice, it just seemed to fit. Before I knew it, it was officially adopted. The boss even modified the background to match the song. Well, to tell the truth, I was the one who was working with Jumbo Madman (called \"Big Man\"). I'll get to that in the second half of the show!) I thought it was a terrible thing when Jumbo Madman (Big Man) ran around with this song, so I adjusted the way he appeared and other things to make him more interesting from a picture point of view. It was a bad idea. Well, if it was going to be like this, I should have wrapped a turban around the elephant.",
"When the boss asked me, \"What are you going to do with Palenque?\" I was asked by the boss, \"What are you going to do with Palenque?\" and I declared, \"Hmmm... I'm going to shoot in India. I gave it to the boss before going to Europe, and it came back with the arrangement as expected. Yay! It's so cool! （Like, \"Yay! When the spaceship sounded, I thought, \"Wow, the boss looks like he's having fun! I thought, \"Wow, the boss seems to be having fun! I'm a little concerned about the similarity of the progression with Curry, but I had no choice but to complete Dangerous Raid and this one in a rush, so I didn't make any changes. And the ones without revisions are sometimes more complete than the ones with. I wonder why. I've been told that it looks like a joke, but I (Palenque) am very serious.",
"Death Play Yudetamago version. This was indeed ancient Japan. I was able to create some pretty austere phrases with the shamisen chancha-cha-cha and the drum pawns, while leaving out the infinity. However, it was MIDI only. I just couldn't get it to sound cool in SSCC. I was so worried about it. I told the boss several times that the Japanese style was too harsh. Then the boss said, \"Hmm, it's like the boss rush of Actraiser. Then it will be soon. Not like ancient Japan, but like ancient \"Yuzo Koshiro\" Japan! Oh, you said it so well! It sounds like only the prelude is infinite, but actually the A melody is infinite. No, well, I intend it to be. Please forgive me for the fact that the second half of the song is completely Actraiser, and the MIDI version is just an awful version of the SSCC data with different tones. It's because of the World Cup.",
"In the full version, it's not so squid something, but in the pre-release version, it's too weak to ever be heard of until solo. Tiamat was a boss that was decided from the beginning to be revised drastically because it was so bad, but during the development of the full version, it was a pretty crazy boss. Both in terms of programming and performance. But it was even crazier in the planning stage. Programmatically. As for the music, I actually like the music itself, but it sounds more like an Ellmac battle than a Tiamat battle. It's quite fast. By the way, the volume of the data was so loud that it was very difficult. The sound was broken.",
"This song had a clear theme from the beginning, and I wanted it to be \"like the last time the legend of Magic Castle was played at Shalom. So I thought about it a lot. The first one was an arrangement of \"Mother will be awakened. It was pretty cool when it was fast, but it lacked punch. No matter how you take it, it doesn't have the same punch as the theme from \"The Legend of the Magic Castle\". It doesn't make me feel like \"Oh, here it comes! Why? Simply because Mother will be awakened is not a song you hear that many times, so maybe it doesn't leave a strong impression on you. That's my guess. Then, I thought of the next song that I would listen to many times, \"Ground. On the other hand, I wanted to emphasize the impact of the song from the prelude to another song...all the material in this area goes there, but in the end, I brought the title screen. I'm glad they got into \"Oh\" unexpectedly. However, I was worried about the development of the last part of the song, and I thought about changing it, but I couldn't come up with a good one. And I was planning to change the MIDI version to a completely different song, but I'm sorry, it was the World Cup. It's all because of the World Cup. I still worked on it until the middle of the song, but I couldn't finish it in time, and you can see the remnants of it in the prelude.",
"This is secretly an arrangement of the title screen, right? Well, this song is quite short. It looks like it might be deformed, but it has the atmosphere of a last boss. I hate this song! Well, the impact of that performance is great for the first-time viewers.",
"If Ore-chan does one more song, the field and the boss fight will be exactly two and a half halves.\" This is the last boss that was replaced for that reason. The concept was \"the last\" anyway. Then, there was a part in the rejected rasboss song where the arrangement of the surface of the earth was used, and I thought, \"That's a good move! So we decided to use the arrangement on the surface of the earth. It is also known as the \"Theme of Dr. Gyakkiri. I thought the tone was a little weak, but I was relieved that I didn't mind it so much because of the sound effects in the game. The start of the song sounds like the last boss of Final Fantasy 5, and then it goes on to say, \"I want the theme of Romancing SaGa 2's 'Ttee! I wanted to end the song with a whistle,\" and so on, and it became La-Mulana's longest song at 3 minutes and 40 seconds per loop. The song became longer, so the boss, who had originally made significant changes in the complete version, made further readjustments to the MIDI version. It is truly a \"rasbos. But! Here, I discovered a problem with the data, or rather, my programming, and with this data structure, it doesn't loop cleanly. There was a note that was played before the beginning of the song to give a sense of the guitar strokes, and because of that, the beats were off for the entire data. So, after a lot of work, the start of this song is 0.5 seconds later than the rest of the songs, in order to match the measures. I don't think you can tell unless you are told.",
"If I had more time, I would have liked to do more with the escape scene. Like making them escape for real. Isn't escape exciting? Like Metroid, Metal Gear, Salamander, etc.",
"When I was checking the data quickly, there were two fanfares and I was like, \"Oh my God! I accidentally deleted something! I deleted something by mistake! I think this is really a game song. It sounds like the ending of an old shooting or action game. The boss says it's called \"Hydride 3,\" but it sounds a bit like \"Raidoc 2. But they're both T&E! What is it with Konami? Well, there's also the song by the Holy Warrior, which sounds a lot like T&E. And the ending is \"Zabungle. I don't care what anyone says, it's Zabunguru. I mean, the boss is already going for it with the song title. Do you want to run? We run!",
"It's game over, but actually, in development mode, it's not game over, so I haven't heard the song much. Seriously. I've never heard the song before, but I've heard it.",
"I remember in 2004, there was an end-of-year event called \"Turning Point\" in TNA, and when I looked at the card, I saw \"Macho Man\" and thought, \"Macho Man without Hogan, this is quite worrisome. When I hear this song, I can only picture Randy Savage in my mind. By the way, it was my mentor's idea that the aerial battle and the stage were switched and the original aerial battle was rejected, so I decided to play the song for the stage. If you ask me why, it's really hard to explain, but I can picture the aerial battle.",
"The song itself is very famous and most people have heard of it, but many people say they don't know the name of the song. To be frank, it would be easier to understand if you call it \"Ehen Mushi no Uta\" or \"Mario Bros. This song was also rejected, and to my surprise, PR3 has quite a few rejected songs. But speaking of Daphnia, I was scared of Daphnia rays. Mijimizuji. I was surprised at the seriousness of the story despite the completely crazy worldview. It was full of bugs. You know?",
"Parodius \"da!\" I think it's \"Manda\". I remember the scene in which James attacks and Paola's character is in the end, and the game ended before I could understand what was going on. I remember I didn't understand what \"Lord British\" meant. Isn't it Slasher and Saber Tiger? So, I was just confused. But I thought it might be Zowie-Scott. I think he might be Zowie Sokotto.",
"Come to think of it, there was a SNES version.",
"When I heard this, I thought, \"How far would you go to make a mukimemo?\" I thought. Here, there was talk of stopping the BGM when he starts saying his tooth hurts, and if we see a scratch, we say, \"Bang! When I saw the wound, I said, \"Bang! We talked about making a special sound effect for omake. We decided not to do that, but there were a lot of songs that were rejected as omake. What the heck!",
"In a word, \"wonderful. It's a lot of things. It's refreshing, how can I say it? At this point, I can finally understand why SD is so important. Like it! Or dislike it! Whoever started it, step forward! When we started chatting about it, I said it was a song that was popular in my hometown, and my mentor said, \"Oh, that's almost the same thing! And then my teacher said, \"Oh, that's almost the same thing! And other things like, \"Gap! Kiai (spirit)!\" And there was also \"gap!",
"I was going to dock this with the BGM on the odd-numbered side of the legend of Majojo. In the end, I didn't have time to do it. But I thought it would be fun to hear \"Galius, but in a Castlevania... well, GREEK Castle is a Castlevania, too, but...! I thought it would be funny.",
"The boss told me not to include it because it was just a sound effect, but I felt bad about leaving it out, so I did. I asked him to comment on it later, and he said, \"What the heck! That's the boss.",
"Well, it was my mistake in selecting the tone. By the way, I intended to dock it with the BGM on the even-numbered side of \"The Legend of Magic Castle. But as I was copying it by ear, I was thinking that this song was so short.",
"When I heard this, I was honestly surprised. This boss makes a sound like this at the very end! Don't point at me!",
"Oi! I would be depressed if they added strange arrangements to this.",
"To be honest, I was also turned off when I heard this. The boss is going to come up with this stuff at the very last minute! A flesh-colored lintel....",
"No, no, no, I was happy to see how gorgeous it was.",
"Again, the boss said, \"It's not a song,\" but I like the idea of expressing something different with a combination of tones. So I added it. Kyahaha!",
"I'm writing this as I'm playing it, thinking, \"Oh, is it really that irritating?\" I'm writing with it on, and I'm thinking, \"Oh, it's so irritating! It's hard to work with this! It breaks my thinking, or whatever you want to call it. The melody is covered by the long tones, but the tempo is absurdly fast. But hell, they found it pretty quickly and cleared it up pretty quickly, didn't they? I thought, \"Oh, La-Mulana is still just barely low in difficulty,\" and there I am.",
"I changed the part, but I thought it was not good enough to make such a proper sound. Actually, I had been thinking about it right before that, but I couldn't come up with a good one. The second point is that the jihadist part is very short.",
"Oh! I miss it! Actually, this prelude is still alive today. At the beginning, when we were in the sample stage, the music for the source of water in the sky was a prototype of the current Sun Temple, and it was a very cold area. It was a very cold area. It was like a quiet underground aqueduct. But now, it's like Salmon's underground water system. The water is so strong here! I was surprised at first. I was surprised at first, but it was actually a place where mechanical things came out.",
"Listening to it now, the atmosphere is very cheerful for a lost gate. It's been getting scarier and scarier. Next to the current version, there is another one that is the same as the current version but a little quieter, and it has a different atmosphere.",
"First, the development was too sluggish and uninteresting. Secondly, the ending was a complete work in progress. And the biggest problem was that the number of pronunciations was over the limit. And one more thing! The route from the Giant's Graveyard to the Moonlight Hall of the Goddess through the Goddess Tower was much closer to the image of the song, as you can see from the rejected version of \"Moonlight Hall of the Goddess\". I thought, \"That's no good. The boss said, \"It's in the back, so why not? But the boss said, \"It's in the back, so it's okay.",
"I liked the riff in the first half, \"Tetterette, tetterette, tetterette,\" and the melody in the second half. However, I didn't like the sound. I think there are some parts that could have been done with the boss' technique. Next, \"How about repeating the first half twice? I liked it, but I didn't like the sound. But once is just too much, and I don't know, I don't know what to do. And then, \"The chorus was not well done. I think the way the second half of the song starts is good, but the last part is not. And the whole song is not following the harshness of this side of the song. That's about it.",
"I haven't decided on the tone and arrangement yet, so it's not safe to publish it. ・・・・ \"The main character climbs the tower using a whip\" is based on the last page of Castlevania. I'm not going to publish it, but it's dangerous to publish it. This was a big problem for me. So, there is a high possibility that it would have been rejected even if I had gone ahead with it. The prelude is a little strange. I wonder if the guys who did this kind of thing were rejected all over the place.",
"This reminds me of a certain game. I mean, that's all there is. It's Quoas. I thought, \"Oh, here comes Quoce,\" but actually it was El Ghiza. It's interesting that the phrase from the front page sticks in at the end. If La-Mulana were a puzzle game, this song would definitely be played somewhere.",
"Is it the cave face of the Dream Continent? I see. The only thing that bothered me about this song was the last part. The last part is too forced, boss! I thought it was too forced. Yes, the MIDI version wasn't bad as a standalone song, but it's just another song. It was like the front and back of 'Mulana.",
"Actually, I don't dislike the song itself. But this one is really, really, \"It doesn't sound like this! I can't hear it like this! The bosses went to a lot of trouble to put in irregular time signatures in the melodious part of the latter half of the song, but the irregular time signatures here really threw me off rhythm and surprised me.",
"It's a technique that's used in the great demons of Galius and the first Dracula boss battles. No - I definitely like the current one. Baphomet's music is better now. I really like it. I have a habit of adjusting the tempo of boss attacks to the tempo of the song, and this song probably makes Baphomet slower. But there is a high possibility of making the attack more nasty.",
"At first, I was going to use the introduction of guidance in \"True Virgin,\" but when I told the boss, \"The introduction is the introduction of guidance...,\" he said, \"Oh, I'm doing that in the last boss,\" and the story hit me. I changed it because I thought it was a bad idea. In the end, it was rejected, but I don't dislike the song itself, although the ending could have used a little more punch. But I thought there was one very big problem. The image that comes to my mind when I hear this song is the boss battle in the prelude, but when it starts, it's the ending. The fight is over! The battle is over! It's like riding a motorcycle with the setting sun in the background.",
"Actually, I like this one better as a boss song. It has more of a \"fighting\" or \"threat\" feel to it. I prefer the previous version as a song, though. The last part of the song is the phrase \"on the ground\". That's the one. That's it! That's the only song in the field that's left untouched! I remembered that song, and it became \"Good Night Mom.\"",
"Should we change the song for the room girder fight? I was thinking about it, too. This furball of a father was a ridiculous guy who would come after you even if you changed sides and was invincible all over unless you solved the riddle. It was possible to escape by going to the back by the gate. No, no, boss, it is programmed to work that way. There is a moving floor, so I could go there. The problem was what to do when they came across the screen. It's kind of scary to be chased by something that's not there. That's what I wanted to do. So, when this thing comes close to the next screen, the music changes, and this was the song for that. However, the tracking logic was too aggressive and the song changed too quickly, and the song I had written for the test was not very scary, so it was first rejected in my mind, and then really rejected. But I couldn't give up on the idea of them chasing after me across the room, so I added it at the last minute. However, when I implemented the song, I made the enemy \"kind of cute\" rather than \"scary. The picture is really scary, though. The song, at the end, is just like the last level of King's Field 1.",
"It's quirky and immersive. I understand what you are trying to say, and it is certainly important, but it's just so terrible.",
"Aaaaahhhh, there it is! There it is! Yes, this is it! I forgot about it!",
"Perhaps some of the tones have been affected by the different versions of SSCC that have changed the balance, but I can't believe it's gone this far. The emergence of this guy, first of all, at the time when the twin-tracks were sounding as a guide, both the master and I were thinking, \"This is the middle stage, isn't it? Actually, at that time, we already had an idea, \"Okay, then maybe we should make this song like this! So we made it all at once. That's why the boss said \"before I knew it\". Well, I just made it as Galius as I could. At that time, the development team was still mainly working on MIDI, and DirectMusic was still very experimental. At that time, we were doing things like using DM to play GR3's Crystal Plane, or playing Resurrection of Ideon when you moved around the stage.",
"Maybe this is not an aerial battle. It's more like a stage. It's hard to explain, but it's something like that. I think I told you that.",
"The New World is used in the first Parodius, but it is the most famous 4th movement, so I removed that and composed the next most famous movements, the 2nd and 3rd. As a result, it is \"dark\" and \"short. Aah. Well, it's \"The sun goes down on a distant mountain\", you know. And it's not the length of a stage piece, and it's an aerial battle in terms of groove. In other words, this is a definite reject!"
            };


        }
    }
}
